{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<START>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<END>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<1-0>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<0-1>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<1/2-1/2>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<UNK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<STEP>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": []
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<START>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<END>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<END>": {
        "id": "<END>",
        "ids": [
          2
        ],
        "tokens": [
          "<END>"
        ]
      },
      "<START>": {
        "id": "<START>",
        "ids": [
          1
        ],
        "tokens": [
          "<START>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<UNK>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<PAD>": 0,
      "<START>": 1,
      "<END>": 2,
      "<1-0>": 3,
      "<0-1>": 4,
      "<1/2-1/2>": 5,
      "<UNK>": 6,
      "<STEP>": 7,
      "1": 8,
      "2": 9,
      "3": 10,
      "4": 11,
      "5": 12,
      "6": 13,
      "7": 14,
      "8": 15,
      "<": 16,
      ">": 17,
      "E": 18,
      "P": 19,
      "S": 20,
      "T": 21,
      "a": 22,
      "b": 23,
      "c": 24,
      "d": 25,
      "e": 26,
      "f": 27,
      "g": 28,
      "h": 29,
      "n": 30,
      "q": 31,
      "r": 32,
      "EP": 33,
      "ST": 34,
      "STEP": 35,
      "f3": 36,
      "f6": 37,
      "e5": 38,
      "d4": 39,
      "e4": 40,
      "d5": 41,
      "e7": 42,
      "d7": 43,
      "c6": 44,
      "e2": 45,
      "c3": 46,
      "d2": 47,
      "c4": 48,
      "g1": 49,
      "g8": 50,
      "c5": 51,
      "e6": 52,
      "f1": 53,
      "f8": 54,
      "d6": 55,
      "f4": 56,
      "g5": 57,
      "d3": 58,
      "d8": 59,
      "e1": 60,
      "d1": 61,
      "e3": 62,
      "g4": 63,
      "f5": 64,
      "e8": 65,
      "c8": 66,
      "c1": 67,
      "c7": 68,
      "b5": 69,
      "g7": 70,
      "c2": 71,
      "b4": 72,
      "g6": 73,
      "f7": 74,
      "f2": 75,
      "b8": 76,
      "b7": 77,
      "g3": 78,
      "g2": 79,
      "b1": 80,
      "b2": 81,
      "h5": 82,
      "b6": 83,
      "h4": 84,
      "b3": 85,
      "h6": 86,
      "h3": 87,
      "a5": 88,
      "h2": 89,
      "a4": 90,
      "h7": 91,
      "a6": 92,
      "a3": 93,
      "a7": 94,
      "a8": 95,
      "a1": 96,
      "a2": 97,
      "g1f3": 98,
      "g8f6": 99,
      "h8": 100,
      "e2e4": 101,
      "d2d4": 102,
      "h1": 103,
      "e1g1": 104,
      "b1c3": 105,
      "b8c6": 106,
      "e8g8": 107,
      "e7e6": 108,
      "d7d5": 109,
      "d7d6": 110,
      "e7e5": 111,
      "g7g6": 112,
      "h2h3": 113,
      "c7c6": 114,
      "c2c3": 115,
      "h7h6": 116,
      "c7c5": 117,
      "a7a6": 118,
      "f8e7": 119,
      "c2c4": 120,
      "g2g3": 121,
      "e2e3": 122,
      "a2a3": 123,
      "d2d3": 124,
      "f2f4": 125,
      "f7f6": 126,
      "f3e5": 127,
      "f1e1": 128,
      "e4e5": 129,
      "b7b6": 130,
      "f2f3": 131,
      "b8d7": 132,
      "f1c4": 133,
      "b2b3": 134,
      "b7b5": 135,
      "f1e2": 136,
      "f6e4": 137,
      "c1g5": 138,
      "e4d5": 139,
      "f8e8": 140,
      "c5d4": 141,
      "f8g7": 142,
      "b1d2": 143,
      "f1d3": 144,
      "c1e3": 145,
      "f7f5": 146,
      "c8d7": 147,
      "c8b7": 148,
      "c8g4": 149,
      "b2b4": 150,
      "f3d4": 151,
      "d4d5": 152,
      "d4e5": 153,
      "d1d2": 154,
      "c4d5": 155,
      "c3d5": 156,
      "f6d5": 157,
      "e6d5": 158,
      "c6d4": 159,
      "a2a4": 160,
      "g2g4": 161,
      "d6e5": 162,
      "e6e5": 163,
      "e5d4": 164,
      "d8d7": 165,
      "a7a5": 166,
      "h2h4": 167,
      "c1d2": 168,
      "d1e2": 169,
      "d8e7": 170,
      "c1f4": 171,
      "a1d1": 172,
      "c8e6": 173,
      "f8d6": 174,
      "a8c8": 175,
      "f1g2": 176,
      "d5e4": 177,
      "e7f6": 178,
      "c6c5": 179,
      "c3e4": 180,
      "h7h5": 181,
      "d6d5": 182,
      "c6e5": 183,
      "e5e4": 184,
      "a8d8": 185,
      "g1h1": 186,
      "f8c5": 187,
      "g7f6": 188,
      "e1c1": 189,
      "c1b2": 190,
      "g7g5": 191,
      "d8c7": 192,
      "a1c1": 193,
      "b7c6": 194,
      "d5d4": 195,
      "g8e7": 196,
      "f3g5": 197,
      "h4h5": 198,
      "f4e5": 199,
      "b2c3": 200,
      "g5f6": 201,
      "g8g7": 202,
      "g8h8": 203,
      "d1f3": 204,
      "f1b5": 205,
      "f4f5": 206,
      "c8f5": 207,
      "e8c8": 208,
      "c3c4": 209,
      "f8b4": 210,
      "g4f3": 211,
      "e3e4": 212,
      "g2f3": 213,
      "e3d4": 214,
      "c6d5": 215,
      "a8b8": 216,
      "g4g5": 217,
      "g6g5": 218,
      "b5b4": 219,
      "d3e4": 220,
      "e2f3": 221,
      "d3d4": 222,
      "f3f4": 223,
      "c3d4": 224,
      "g1g2": 225,
      "h3h4": 226,
      "a1b1": 227,
      "f6f5": 228,
      "g3g4": 229,
      "c4c5": 230,
      "c5c4": 231,
      "a5a4": 232,
      "g5g4": 233,
      "d1c2": 234,
      "d8f6": 235,
      "h5h4": 236,
      "d5c4": 237,
      "f5f4": 238,
      "d7c6": 239,
      "f6g4": 240,
      "b4b5": 241,
      "f7e6": 242,
      "b4c3": 243,
      "f6e5": 244,
      "a4a5": 245,
      "h6h5": 246,
      "b5c6": 247,
      "e7d6": 248,
      "d8d5": 249,
      "a6a5": 250,
      "f1d1": 251,
      "d4c5": 252,
      "f8d8": 253,
      "e8e7": 254,
      "a1e1": 255,
      "f5e4": 256,
      "d1d3": 257,
      "g1e2": 258,
      "d7e5": 259,
      "d1d4": 260,
      "g1h2": 261,
      "h8g8": 262,
      "g1f1": 263,
      "e1e2": 264,
      "c4b3": 265,
      "b6b5": 266,
      "f2e3": 267,
      "g8f8": 268,
      "d8b6": 269,
      "g8h7": 270,
      "a8e8": 271,
      "e2d3": 272,
      "e8d8": 273,
      "e5f6": 274,
      "f3e4": 275,
      "d1e1": 276,
      "f6d7": 277,
      "g1f2": 278,
      "d7f6": 279,
      "e5f4": 280,
      "g5h4": 281,
      "d8e8": 282,
      "h6g5": 283,
      "f8f7": 284,
      "e6f5": 285,
      "b3b4": 286,
      "h1g1": 287,
      "e1d1": 288,
      "g4h5": 289,
      "g8f7": 290,
      "a3a4": 291,
      "c3e2": 292,
      "d2c3": 293,
      "d2f3": 294,
      "d3c4": 295,
      "g7h6": 296,
      "e4f5": 297,
      "c3b5": 298,
      "d8d6": 299,
      "f1f2": 300,
      "h5g6": 301,
      "f6h5": 302,
      "e3f4": 303,
      "g5f4": 304,
      "e5e6": 305,
      "c4b5": 306,
      "f7g6": 307,
      "h3g4": 308,
      "d2e4": 309,
      "e8f8": 310,
      "d5d6": 311,
      "d6c5": 312,
      "b5c4": 313,
      "h7g6": 314,
      "h4g3": 315,
      "c1b1": 316,
      "g4f5": 317,
      "c6e7": 318,
      "c4d3": 319,
      "e5d6": 320,
      "d4d3": 321,
      "f3h4": 322,
      "e1f1": 323,
      "f4g3": 324,
      "d8c8": 325,
      "h5h6": 326,
      "c8b8": 327,
      "f3d2": 328,
      "g6f5": 329,
      "g2h3": 330,
      "f6g5": 331,
      "f5g6": 332,
      "c6b4": 333,
      "d7e6": 334,
      "f4g5": 335,
      "d1b3": 336,
      "f2g3": 337,
      "e4e3": 338,
      "d2e3": 339,
      "h2g3": 340,
      "b4c5": 341,
      "d5c6": 342,
      "d7c5": 343,
      "h4g5": 344,
      "a6b5": 345,
      "e4f6": 346,
      "g3f4": 347,
      "d1c1": 348,
      "f3g4": 349,
      "e7f5": 350,
      "e4f3": 351,
      "d5e6": 352,
      "h5g4": 353,
      "c7d6": 354,
      "d1d8": 355,
      "h4h3": 356,
      "d4c3": 357,
      "c2d3": 358,
      "f3g3": 359,
      "c5b6": 360,
      "c6a5": 361,
      "a4a3": 362,
      "e8d7": 363,
      "f5f6": 364,
      "e5f3": 365,
      "f4f3": 366,
      "d3e2": 367,
      "a5a6": 368,
      "b3c4": 369,
      "d1h5": 370,
      "a3b4": 371,
      "g4g3": 372,
      "e7g6": 373,
      "d8d1": 374,
      "e8f7": 375,
      "b6c5": 376,
      "g5g6": 377,
      "d4c6": 378,
      "d8a5": 379,
      "d7b6": 380,
      "f5g4": 381,
      "c5b4": 382,
      "e7d7": 383,
      "d6e7": 384,
      "b5a4": 385,
      "d2c4": 386,
      "c5c6": 387,
      "e7g5": 388,
      "d6d7": 389,
      "c4c3": 390,
      "f4e3": 391,
      "f6g6": 392,
      "a4b5": 393,
      "f5e6": 394,
      "f8g8": 395,
      "e2g3": 396,
      "d3d2": 397,
      "a5b4": 398,
      "e2d2": 399,
      "c8c7": 400,
      "d4f3": 401,
      "c7b6": 402,
      "c2b3": 403,
      "b4b3": 404,
      "d3c2": 405,
      "c6b5": 406,
      "c5d6": 407,
      "e2f4": 408,
      "a1f1": 409,
      "c1c2": 410,
      "c3a4": 411,
      "e4d3": 412,
      "f1g1": 413,
      "e6e7": 414,
      "d4e3": 415,
      "a4b3": 416,
      "b5b6": 417,
      "a8f8": 418,
      "f8c8": 419,
      "f6e7": 420,
      "e7c5": 421,
      "f3e2": 422,
      "c3b4": 423,
      "e3d2": 424,
      "e5c6": 425,
      "d2e2": 426,
      "h1h2": 427,
      "d5f6": 428,
      "d7e7": 429,
      "e3e2": 430,
      "d1d5": 431,
      "d8d4": 432,
      "h6g7": 433,
      "h8h7": 434,
      "f6f7": 435,
      "c8d8": 436,
      "f7e7": 437,
      "c8a6": 438,
      "b7a6": 439,
      "d7c7": 440,
      "e7f7": 441,
      "g6h5": 442,
      "g3h4": 443,
      "c1d1": 444,
      "e1d2": 445,
      "c6c7": 446,
      "f3f2": 447,
      "e6d7": 448,
      "g5e7": 449,
      "a5b6": 450,
      "a3a2": 451,
      "b4a5": 452,
      "c3c2": 453,
      "f3e3": 454,
      "f2e2": 455,
      "f1c1": 456,
      "e4c3": 457,
      "e2f2": 458,
      "e1e3": 459,
      "d2b3": 460,
      "a6a7": 461,
      "d2c2": 462,
      "b3c2": 463,
      "e5c4": 464,
      "d8h4": 465,
      "f6g7": 466,
      "h8f8": 467,
      "h6h7": 468,
      "a2b3": 469,
      "g5h6": 470,
      "f1f3": 471,
      "e7d5": 472,
      "h1e1": 473,
      "e4d6": 474,
      "e7f8": 475,
      "d5c3": 476,
      "g7f8": 477,
      "h7h8": 478,
      "b8a6": 479,
      "d1a4": 480,
      "e2c4": 481,
      "b2a3": 482,
      "e7d8": 483,
      "d1g4": 484,
      "e5d7": 485,
      "f7g7": 486,
      "g8h6": 487,
      "h8e8": 488,
      "e1f2": 489,
      "e5d3": 490,
      "e2d4": 491,
      "d6c7": 492,
      "f6e6": 493,
      "d8g5": 494,
      "g7g8": 495,
      "h3h2": 496,
      "c7d7": 497,
      "h2h1": 498,
      "d1d7": 499,
      "g3g2": 500,
      "e3f2": 501,
      "b1a3": 502,
      "e2g4": 503,
      "b3b2": 504,
      "d4f5": 505,
      "e4c5": 506,
      "g5e3": 507,
      "g6g7": 508,
      "b6c7": 509,
      "d8f8": 510,
      "b6b7": 511,
      "f7f8": 512,
      "d5f4": 513,
      "c7b7": 514,
      "e7e8": 515,
      "d3f5": 516,
      "e3f3": 517,
      "e6f7": 518,
      "e1e4": 519,
      "e4g5": 520,
      "f8f6": 521,
      "g3f3": 522,
      "d1f1": 523,
      "c2d2": 524,
      "g7e5": 525,
      "c4e6": 526,
      "h1f1": 527,
      "g4h3": 528,
      "e1e5": 529,
      "a7b6": 530,
      "e5g6": 531,
      "d3e3": 532,
      "e3d3": 533,
      "e5g4": 534,
      "d8d2": 535,
      "e1e8": 536,
      "d7d8": 537,
      "f2g2": 538,
      "e3c5": 539,
      "d3c3": 540,
      "d1d6": 541,
      "g7f7": 542,
      "e3g5": 543,
      "g5e6": 544,
      "e6d6": 545,
      "a7a8": 546,
      "d6c6": 547,
      "b5d7": 548,
      "d7e8": 549,
      "h3g2": 550,
      "a8a7": 551,
      "b7d5": 552,
      "f3g2": 553,
      "g5f3": 554,
      "g2f1": 555,
      "a2a1": 556,
      "g2g1": 557,
      "e8e1": 558,
      "e8e6": 559,
      "f2f1": 560,
      "g2f2": 561,
      "b3a4": 562,
      "g6f6": 563,
      "e1e7": 564,
      "b6a5": 565,
      "e2e1": 566,
      "e2d1": 567,
      "e7c6": 568,
      "e6f6": 569,
      "c2b2": 570,
      "b8c8": 571,
      "d2d1": 572,
      "f4d6": 573,
      "d5e7": 574,
      "a1a2": 575,
      "c7c8": 576,
      "b8b7": 577,
      "d6f4": 578,
      "e2f1": 579,
      "d6e6": 580,
      "g4e3": 581,
      "b1c1": 582,
      "e7h4": 583,
      "g6f7": 584,
      "e4g3": 585,
      "g3f2": 586,
      "d5e3": 587,
      "e8e5": 588,
      "d7b5": 589,
      "f5d3": 590,
      "d2f4": 591,
      "b1b2": 592,
      "g4e6": 593,
      "e4d2": 594,
      "h8d8": 595,
      "b7e4": 596,
      "d3b5": 597,
      "d4e6": 598,
      "g4e2": 599,
      "c6d7": 600,
      "h8g7": 601,
      "c1a3": 602,
      "e7b4": 603,
      "h1d1": 604,
      "c4f7": 605,
      "c2c1": 606,
      "h7g8": 607,
      "c5e3": 608,
      "d8d3": 609,
      "d4e2": 610,
      "h5f4": 611,
      "h7g7": 612,
      "h2g1": 613,
      "b7c8": 614,
      "h2g2": 615,
      "g4f6": 616,
      "g4e5": 617,
      "h1g2": 618,
      "c1h6": 619,
      "e1e6": 620,
      "d7c8": 621,
      "g7h7": 622,
      "e2c3": 623,
      "b7b8": 624,
      "f6e8": 625,
      "e2h5": 626,
      "b2b1": 627,
      "f7e8": 628,
      "e8e2": 629,
      "d5e5": 630,
      "d3g6": 631,
      "g3h3": 632,
      "g5e4": 633,
      "f3h2": 634,
      "b5d6": 635,
      "e6c4": 636,
      "c4e2": 637,
      "e4d4": 638,
      "g2h2": 639,
      "e5d5": 640,
      "e2b5": 641,
      "d7f5": 642,
      "c5e4": 643,
      "f4e4": 644,
      "g5f7": 645,
      "b8a8": 646,
      "d2g5": 647,
      "d4c4": 648,
      "b4d2": 649,
      "c3d2": 650,
      "f4g4": 651,
      "d2b4": 652,
      "e4f4": 653,
      "d2e1": 654,
      "h5f3": 655,
      "g1h3": 656,
      "c4e5": 657,
      "e8e4": 658,
      "c8c2": 659,
      "g6h6": 660,
      "b1a1": 661,
      "e5f5": 662,
      "f7g8": 663,
      "g4h4": 664,
      "h3g3": 665,
      "d4e4": 666,
      "c2e4": 667,
      "c6b6": 668,
      "d4b5": 669,
      "b7a7": 670,
      "f5e5": 671,
      "h5g5": 672,
      "b2a2": 673,
      "d7g4": 674,
      "g5h5": 675,
      "g4f4": 676,
      "g6f4": 677,
      "b5d3": 678,
      "a5c4": 679,
      "f5g5": 680,
      "g5f5": 681,
      "h4f5": 682,
      "b2d4": 683,
      "f6d4": 684,
      "h6g6": 685,
      "d5c5": 686,
      "b6c4": 687,
      "e5f7": 688,
      "e3h6": 689,
      "g2e4": 690,
      "b7c7": 691,
      "g7d4": 692,
      "c3d3": 693,
      "c7e5": 694,
      "h4g4": 695,
      "c1c7": 696,
      "c7d8": 697,
      "g3f5": 698,
      "d7f8": 699,
      "d2c1": 700,
      "c5d3": 701,
      "d5b6": 702,
      "c6b7": 703,
      "c3b2": 704,
      "e6g4": 705,
      "b3d5": 706,
      "f8f5": 707,
      "d2f1": 708,
      "f8b8": 709,
      "c6d6": 710,
      "b6c6": 711,
      "c5e7": 712,
      "b6d5": 713,
      "c4d6": 714,
      "d4b3": 715,
      "f1f4": 716,
      "h4f6": 717,
      "b7f3": 718,
      "b2c2": 719,
      "b4d3": 720,
      "c4e3": 721,
      "a6b7": 722,
      "f3d5": 723,
      "d4c2": 724,
      "d5d8": 725,
      "f6h7": 726,
      "f1b1": 727,
      "g7h8": 728,
      "f5d4": 729,
      "d5c7": 730,
      "f2e1": 731,
      "d5b4": 732,
      "d6b4": 733,
      "h5f6": 734,
      "c3b3": 735,
      "b6d4": 736,
      "b5c3": 737,
      "b2c1": 738,
      "b4d6": 739,
      "c8h3": 740,
      "b2e5": 741,
      "c5e6": 742,
      "g6e5": 743,
      "g6h7": 744,
      "a4c5": 745,
      "d8b8": 746,
      "g3e5": 747,
      "d1b1": 748,
      "b3c3": 749,
      "f5e3": 750,
      "c8c6": 751,
      "g3e4": 752,
      "b4a3": 753,
      "b5a6": 754,
      "b4c6": 755,
      "f3e1": 756,
      "g3h2": 757,
      "e8e3": 758,
      "c4d4": 759,
      "c7e7": 760,
      "d6g3": 761,
      "c2d1": 762,
      "c5f2": 763,
      "f2g1": 764,
      "h4f3": 765,
      "c5d5": 766,
      "c1c3": 767,
      "b8b2": 768,
      "b1b7": 769,
      "c1e1": 770,
      "c8c3": 771,
      "b5c7": 772,
      "c8c4": 773,
      "c8e8": 774,
      "c8c1": 775,
      "b3c5": 776,
      "b8d8": 777,
      "d8a8": 778,
      "a3b2": 779,
      "g5d2": 780,
      "f4d5": 781,
      "d1a1": 782,
      "b4e7": 783,
      "f1f7": 784,
      "g4f2": 785,
      "c1c8": 786,
      "d1g1": 787,
      "h6f5": 788,
      "f4d3": 789,
      "e4f2": 790,
      "b1d1": 791,
      "b7a8": 792,
      "c5b5": 793,
      "d2h6": 794,
      "b6b2": 795,
      "c4b4": 796,
      "a7b7": 797,
      "b6a6": 798,
      "d3h7": 799,
      "a5c7": 800,
      "d4d1": 801,
      "c3d1": 802,
      "f3h5": 803,
      "a2b2": 804,
      "f4e6": 805,
      "d2f2": 806,
      "f3h3": 807,
      "b3d4": 808,
      "d4f6": 809,
      "f5d6": 810,
      "g6e4": 811,
      "c2e2": 812,
      "d8g8": 813,
      "f5e7": 814,
      "g4d7": 815,
      "b2f6": 816,
      "g2d5": 817,
      "f1f8": 818,
      "f1f6": 819,
      "c4a2": 820,
      "c7b8": 821,
      "c6e4": 822,
      "f6h4": 823,
      "f8h6": 824,
      "g2h1": 825,
      "b3a3": 826,
      "a5c6": 827,
      "e7c7": 828,
      "e2c2": 829,
      "c6d8": 830,
      "c2b1": 831,
      "b4c2": 832,
      "f8a8": 833,
      "h4e7": 834,
      "h4g6": 835,
      "f4d2": 836,
      "f4e2": 837,
      "d5f3": 838,
      "f1f5": 839,
      "f8f1": 840,
      "f8f4": 841,
      "a6c5": 842,
      "b2a1": 843,
      "a3c4": 844,
      "e3b6": 845,
      "d7b7": 846,
      "e3g3": 847,
      "a4b4": 848,
      "d3f3": 849,
      "b5e2": 850,
      "b5d4": 851,
      "b4c4": 852,
      "b1a2": 853,
      "a5b5": 854,
      "f3f6": 855,
      "d2b2": 856,
      "c8c5": 857,
      "d7f7": 858,
      "f1a1": 859,
      "f8f2": 860,
      "f8f3": 861,
      "b4d5": 862,
      "b5c5": 863,
      "a4c2": 864,
      "c5d7": 865,
      "h5g3": 866,
      "f8h8": 867,
      "a8g8": 868,
      "c1c6": 869,
      "f3d3": 870,
      "e2e5": 871,
      "f4h6": 872,
      "d6e4": 873,
      "b8a7": 874,
      "f4c7": 875,
      "e5g3": 876,
      "f3d1": 877,
      "a8a6": 878,
      "f6b2": 879,
      "e4c6": 880,
      "g7c3": 881,
      "b1c2": 882,
      "d4d2": 883,
      "e4e2": 884,
      "c4d2": 885,
      "b6d7": 886,
      "a6b6": 887,
      "d5d7": 888,
      "d7a4": 889,
      "b8c7": 890,
      "c3e5": 891,
      "f3c6": 892,
      "b3a2": 893,
      "d7h3": 894,
      "b3b7": 895,
      "f5d7": 896,
      "b5a5": 897,
      "b4a4": 898,
      "e5g7": 899,
      "f5c2": 900,
      "f6c3": 901,
      "d5a5": 902,
      "d5b7": 903,
      "e4g6": 904,
      "c1c5": 905,
      "h6g4": 906,
      "a1g1": 907,
      "a5c3": 908,
      "a6c4": 909,
      "a1a3": 910,
      "h2g4": 911,
      "d6f5": 912,
      "f6d8": 913,
      "e5c3": 914,
      "h5e2": 915,
      "d3e5": 916,
      "d5b3": 917,
      "e6h3": 918,
      "c1c4": 919,
      "a3b3": 920,
      "f3b7": 921,
      "f6f3": 922,
      "e6g6": 923,
      "d3f4": 924,
      "f5h4": 925,
      "a2a1q": 926,
      "e3f5": 927,
      "f1h1": 928,
      "a7a8q": 929,
      "a4c3": 930,
      "b1e1": 931,
      "f6h6": 932,
      "f3f7": 933,
      "a1a7": 934,
      "b3e6": 935,
      "b8e8": 936,
      "g6e7": 937,
      "a4c6": 938,
      "h3f4": 939,
      "f1h3": 940,
      "c8f8": 941,
      "e3d5": 942,
      "h5f7": 943,
      "g4h6": 944,
      "c7a5": 945,
      "c8a8": 946,
      "e7e4": 947,
      "g5d8": 948,
      "c2a2": 949,
      "e4c2": 950,
      "c2f5": 951,
      "e5g5": 952,
      "c6b8": 953,
      "h6f4": 954,
      "c6f3": 955,
      "f5h6": 956,
      "g3h5": 957,
      "h8c8": 958,
      "d6f6": 959,
      "b6a7": 960,
      "f6f4": 961,
      "b1b3": 962,
      "d4f2": 963,
      "c7a7": 964,
      "c7d5": 965,
      "f3f5": 966,
      "e5c7": 967,
      "e5e7": 968,
      "a6b4": 969,
      "d5f7": 970,
      "e7g7": 971,
      "h3g5": 972,
      "d2a5": 973,
      "b8b6": 974,
      "a5b3": 975,
      "a6c7": 976,
      "a2b1": 977,
      "f4h5": 978,
      "e6f4": 979,
      "d4b2": 980,
      "d6c4": 981,
      "h4f2": 982,
      "a8a2": 983,
      "d1h1": 984,
      "e6b3": 985,
      "a8a1": 986,
      "e3g4": 987,
      "e4g4": 988,
      "e2g2": 989,
      "c1f1": 990,
      "d8h8": 991,
      "e6d4": 992,
      "d4b6": 993,
      "d3c5": 994,
      "c4b6": 995,
      "g3e2": 996,
      "b6d8": 997,
      "f4g6": 998,
      "d6d8": 999,
      "d3b1": 1000,
      "f4h3": 1001,
      "a1a8": 1002,
      "d4g7": 1003,
      "d3a6": 1004,
      "g5h3": 1005,
      "e3a7": 1006,
      "d3f1": 1007,
      "a6d3": 1008,
      "c7f4": 1009,
      "c7f7": 1010,
      "c2e3": 1011,
      "d6h2": 1012,
      "c1a1": 1013,
      "e1b1": 1014,
      "f5g3": 1015,
      "e4b7": 1016,
      "a5c5": 1017,
      "e7b7": 1018,
      "c5b3": 1019,
      "b3d2": 1020,
      "a8a5": 1021,
      "e2e6": 1022,
      "c7a8": 1023,
      "h5e5": 1024,
      "c2f2": 1025,
      "c2d4": 1026,
      "h8h6": 1027,
      "g8g6": 1028,
      "b6e3": 1029,
      "c2a4": 1030,
      "e4g2": 1031,
      "f4h2": 1032,
      "g6h4": 1033,
      "d3d1": 1034,
      "a3c2": 1035,
      "e5b2": 1036,
      "c3f6": 1037,
      "b4b2": 1038,
      "d3b3": 1039,
      "h7g5": 1040,
      "d4f4": 1041,
      "d3g3": 1042,
      "g4d1": 1043,
      "c7e6": 1044,
      "g7b2": 1045,
      "b7g2": 1046,
      "a4c4": 1047,
      "d5f5": 1048,
      "b6b4": 1049,
      "h6e3": 1050,
      "f6g8": 1051,
      "a3c5": 1052,
      "a3b5": 1053,
      "h6f7": 1054,
      "e8b8": 1055,
      "e6g5": 1056,
      "b5b7": 1057,
      "d3d5": 1058,
      "d2d5": 1059,
      "d6b6": 1060,
      "f5h5": 1061,
      "f6d6": 1062,
      "d6f8": 1063,
      "a1a4": 1064,
      "c5a7": 1065,
      "e6c5": 1066,
      "f4h4": 1067,
      "e5e3": 1068,
      "g2c6": 1069,
      "b2g7": 1070,
      "e2e7": 1071,
      "a8h8": 1072,
      "f1g3": 1073,
      "g6d3": 1074,
      "h1h3": 1075,
      "h3f5": 1076,
      "e2b2": 1077,
      "f5h3": 1078,
      "h4f4": 1079,
      "f7d7": 1080,
      "g3d6": 1081,
      "g1g3": 1082,
      "h3e6": 1083,
      "a7b8": 1084,
      "e3c4": 1085,
      "c2g6": 1086,
      "b3d1": 1087,
      "c7c4": 1088,
      "f2d2": 1089,
      "a4b6": 1090,
      "g4g6": 1091,
      "h1c1": 1092,
      "g5g3": 1093,
      "b2b1q": 1094,
      "c5c7": 1095,
      "h7h8q": 1096,
      "f4f6": 1097,
      "h5f5": 1098,
      "c3b1": 1099,
      "e5e2": 1100,
      "e3c3": 1101,
      "d7a7": 1102,
      "e4e6": 1103,
      "f4f2": 1104,
      "e5c5": 1105,
      "e2a6": 1106,
      "h8h5": 1107,
      "e1a1": 1108,
      "b8b4": 1109,
      "e6a2": 1110,
      "e7a3": 1111,
      "a1h1": 1112,
      "e6e8": 1113,
      "f5f7": 1114,
      "e3e5": 1115,
      "g4e4": 1116,
      "c6a7": 1117,
      "d5d3": 1118,
      "c2a1": 1119,
      "g5e5": 1120,
      "e8f6": 1121,
      "g3e3": 1122,
      "a7c7": 1123,
      "e3c1": 1124,
      "b6d6": 1125,
      "e5h5": 1126,
      "b7d7": 1127,
      "d5g2": 1128,
      "h5h7": 1129,
      "d7d4": 1130,
      "f7e5": 1131,
      "b7b8q": 1132,
      "b8b5": 1133,
      "a8b7": 1134,
      "c3e3": 1135,
      "c4c2": 1136,
      "f5f3": 1137,
      "a2c2": 1138,
      "b2d2": 1139,
      "c4a5": 1140,
      "f2d4": 1141,
      "e4h4": 1142,
      "d6d4": 1143,
      "a8a3": 1144,
      "e6c6": 1145,
      "e3e1": 1146,
      "b1f1": 1147,
      "c3a3": 1148,
      "h2h1q": 1149,
      "d6b7": 1150,
      "d4b4": 1151,
      "d4d8": 1152,
      "f8g6": 1153,
      "h4e4": 1154,
      "h6f8": 1155,
      "a3d6": 1156,
      "c6e6": 1157,
      "h2f3": 1158,
      "c4b2": 1159,
      "d6f7": 1160,
      "e4c4": 1161,
      "a1a5": 1162,
      "f6f2": 1163,
      "d2a2": 1164,
      "c3a2": 1165,
      "e7c8": 1166,
      "b3d3": 1167,
      "c7c8q": 1168,
      "c4a6": 1169,
      "g3g5": 1170,
      "h5h3": 1171,
      "f3c3": 1172,
      "e7e2": 1173,
      "a1a6": 1174,
      "a8a4": 1175,
      "d4d6": 1176,
      "d4a4": 1177,
      "d5b5": 1178,
      "c4e4": 1179,
      "a5d8": 1180,
      "c6a6": 1181,
      "g6e6": 1182,
      "e8a8": 1183,
      "b1b4": 1184,
      "c4a4": 1185,
      "h3f3": 1186,
      "e4e1": 1187,
      "d7g7": 1188,
      "e6f8": 1189,
      "b8f8": 1190,
      "f7h7": 1191,
      "b1b8": 1192,
      "c5e5": 1193,
      "b3f7": 1194,
      "b5a7": 1195,
      "h1h4": 1196,
      "c5a4": 1197,
      "h8h4": 1198,
      "e7e3": 1199,
      "a4d7": 1200,
      "h1h5": 1201,
      "b8b1": 1202,
      "d5d2": 1203,
      "e1g3": 1204,
      "h3f2": 1205,
      "c6a4": 1206,
      "c7c3": 1207,
      "e6e4": 1208,
      "e8g6": 1209,
      "b8b3": 1210,
      "b3b5": 1211,
      "d2g2": 1212,
      "g2b7": 1213,
      "a5a2": 1214,
      "c5a5": 1215,
      "b1b5": 1216,
      "e2c1": 1217,
      "a1b2": 1218,
      "e4e7": 1219,
      "d2d6": 1220,
      "g5h7": 1221,
      "e6c7": 1222,
      "a6e2": 1223,
      "c2c1q": 1224,
      "d5d1": 1225,
      "f2h4": 1226,
      "e1h1": 1227,
      "f7d5": 1228,
      "c6a8": 1229,
      "h4h6": 1230,
      "f7d6": 1231,
      "d4d7": 1232,
      "d3b2": 1233,
      "f4d4": 1234,
      "d7d1": 1235,
      "c7c2": 1236,
      "c5b7": 1237,
      "h7f6": 1238,
      "a6c6": 1239,
      "d6g6": 1240,
      "e3f1": 1241,
      "c2c7": 1242,
      "g7g8q": 1243,
      "c5a6": 1244,
      "e6c8": 1245,
      "f3g1": 1246,
      "c7g3": 1247,
      "c7b5": 1248,
      "d2d8": 1249,
      "e5e1": 1250,
      "g2g1q": 1251,
      "c3a5": 1252,
      "g1g7": 1253,
      "g4g7": 1254,
      "d3f2": 1255,
      "b1b6": 1256,
      "d4g4": 1257,
      "f8e6": 1258,
      "a5d2": 1259,
      "b7e7": 1260,
      "g8g2": 1261,
      "e8h8": 1262,
      "c2c5": 1263,
      "f2e4": 1264,
      "c4c6": 1265,
      "c4c7": 1266,
      "f5g7": 1267,
      "b4d4": 1268,
      "f2h2": 1269,
      "f1e3": 1270,
      "g1e1": 1271,
      "c4f1": 1272,
      "d7d8q": 1273,
      "a4a2": 1274,
      "e5e8": 1275,
      "g8e8": 1276,
      "b6f2": 1277,
      "d6a3": 1278,
      "f2c2": 1279,
      "f7h8": 1280,
      "c6c4": 1281,
      "a2c4": 1282,
      "b4a6": 1283,
      "d2d7": 1284,
      "g8g5": 1285,
      "d5h5": 1286,
      "f7c7": 1287,
      "g6f8": 1288,
      "h1h7": 1289,
      "e3c2": 1290,
      "g5g2": 1291,
      "a3c3": 1292,
      "d6b8": 1293,
      "g5c1": 1294,
      "c5c3": 1295,
      "f5h7": 1296,
      "f5d5": 1297,
      "h4h2": 1298,
      "g6g4": 1299,
      "h8h3": 1300,
      "e7e1": 1301,
      "f6f8": 1302,
      "f8a3": 1303,
      "c6e8": 1304,
      "a4a7": 1305,
      "h8a8": 1306,
      "c4a3": 1307,
      "f4c1": 1308,
      "a5a7": 1309,
      "f6c6": 1310,
      "d3b4": 1311,
      "d7b8": 1312,
      "b5a3": 1313,
      "c6c8": 1314,
      "a2d5": 1315,
      "c3a1": 1316,
      "e2e8": 1317,
      "d3d6": 1318,
      "a5a3": 1319,
      "h5g7": 1320,
      "h1h6": 1321,
      "g5g7": 1322,
      "g1g4": 1323,
      "d6b5": 1324,
      "e8d6": 1325,
      "a7d7": 1326,
      "c3c5": 1327,
      "e3h3": 1328,
      "c5f8": 1329,
      "c3c1": 1330,
      "c5c2": 1331,
      "d1e3": 1332,
      "h6f6": 1333,
      "c2c6": 1334,
      "g3g6": 1335,
      "d4h4": 1336,
      "c3g7": 1337,
      "g4g2": 1338,
      "h1a1": 1339,
      "f7f8q": 1340,
      "f4f7": 1341,
      "e6e2": 1342,
      "b4a2": 1343,
      "c5a3": 1344,
      "b7c5": 1345,
      "a6a8": 1346,
      "d3d8": 1347,
      "c3e1": 1348,
      "b4b6": 1349,
      "h8h2": 1350,
      "e6g7": 1351,
      "a3e7": 1352,
      "d2d1q": 1353,
      "a4a6": 1354,
      "c6g2": 1355,
      "e7e8q": 1356,
      "b2c4": 1357,
      "a4d1": 1358,
      "c3f3": 1359,
      "f7g5": 1360,
      "h6d2": 1361,
      "f2d3": 1362,
      "f2g4": 1363,
      "d7d2": 1364,
      "c2b4": 1365,
      "b2e2": 1366,
      "d5a2": 1367,
      "g3f1": 1368,
      "b6b3": 1369,
      "b3b6": 1370,
      "c3c7": 1371,
      "f4g2": 1372,
      "a7b5": 1373,
      "f3f1": 1374,
      "e8c6": 1375,
      "f1a6": 1376,
      "g7f5": 1377,
      "e3e6": 1378,
      "e4h7": 1379,
      "e1f3": 1380,
      "d6a6": 1381,
      "g8g4": 1382,
      "g4h2": 1383,
      "d5g5": 1384,
      "b7f7": 1385,
      "d7d3": 1386,
      "e2a2": 1387,
      "g1d1": 1388,
      "c6c3": 1389,
      "g8d8": 1390,
      "e7a7": 1391,
      "d3d7": 1392,
      "f5f2": 1393,
      "h8b8": 1394,
      "a8c6": 1395,
      "h3f1": 1396,
      "a5b7": 1397,
      "f2f1q": 1398,
      "e1d3": 1399,
      "a5d5": 1400,
      "a6c8": 1401,
      "b6a4": 1402,
      "a7c5": 1403,
      "e5h2": 1404,
      "e4e8": 1405,
      "c3c6": 1406,
      "e3e7": 1407,
      "c7g7": 1408,
      "g1g5": 1409,
      "c2g2": 1410,
      "e2e1q": 1411,
      "b5d5": 1412,
      "b5b3": 1413,
      "h1h8": 1414,
      "d5a8": 1415,
      "h6h4": 1416,
      "d8e6": 1417,
      "h7f7": 1418,
      "d6d2": 1419,
      "b2f2": 1420,
      "f3b3": 1421,
      "d6d1": 1422,
      "f7f4": 1423,
      "g3g7": 1424,
      "d6d3": 1425,
      "g6c2": 1426,
      "c6c2": 1427,
      "g4c8": 1428,
      "b4b7": 1429,
      "h3h5": 1430,
      "f7h5": 1431,
      "g6g3": 1432,
      "a6f1": 1433,
      "f5c8": 1434,
      "a7e7": 1435,
      "a2d2": 1436,
      "d6c8": 1437,
      "b3a5": 1438,
      "b6e6": 1439,
      "d3a3": 1440,
      "a3a1": 1441,
      "d4a7": 1442,
      "a5e5": 1443,
      "e6h6": 1444,
      "g1g6": 1445,
      "h1b1": 1446,
      "a7d4": 1447,
      "e3g2": 1448,
      "a1c3": 1449,
      "h8h1": 1450,
      "g8g3": 1451,
      "e6e1": 1452,
      "f2b2": 1453,
      "b3e3": 1454,
      "f3a8": 1455,
      "e8c7": 1456,
      "e6d8": 1457,
      "e1h4": 1458,
      "e1c3": 1459,
      "f2f5": 1460,
      "b5b2": 1461,
      "d3h3": 1462,
      "h2f4": 1463,
      "a3c1": 1464,
      "b6b8": 1465,
      "g3d3": 1466,
      "d4a1": 1467,
      "f7b7": 1468,
      "b1e4": 1469,
      "d2b1": 1470,
      "b2d3": 1471,
      "b6c8": 1472,
      "c6f6": 1473,
      "e7h7": 1474,
      "e3e8": 1475,
      "h2e5": 1476,
      "a2e2": 1477,
      "e6e3": 1478,
      "f2c5": 1479,
      "b7d6": 1480,
      "g7e7": 1481,
      "b1d3": 1482,
      "e5h8": 1483,
      "e8h5": 1484,
      "a2b4": 1485,
      "g6g2": 1486,
      "f4b8": 1487,
      "a7f7": 1488,
      "h3d7": 1489,
      "e3d1": 1490,
      "a4d4": 1491,
      "f2f7": 1492,
      "g3c7": 1493,
      "f7f3": 1494,
      "h4d8": 1495,
      "h3h6": 1496,
      "h4g2": 1497,
      "b3b1": 1498,
      "a4b2": 1499,
      "e2h2": 1500,
      "f2f6": 1501,
      "f7d8": 1502,
      "g3e1": 1503,
      "b7b3": 1504,
      "b5f1": 1505,
      "h2f2": 1506,
      "b7b4": 1507,
      "f6h8": 1508,
      "g4d4": 1509,
      "f5b1": 1510,
      "a7c6": 1511,
      "c5c8": 1512,
      "f6a1": 1513,
      "d3c1": 1514,
      "a2e6": 1515,
      "h5d1": 1516,
      "a3a5": 1517,
      "f4f1": 1518,
      "h8f6": 1519,
      "c8g8": 1520,
      "h4h7": 1521,
      "d8c6": 1522,
      "h6h3": 1523,
      "a2f2": 1524,
      "a6d6": 1525,
      "a1d4": 1526,
      "h5h8": 1527,
      "h7f5": 1528,
      "a3f8": 1529,
      "b4f8": 1530,
      "a7e3": 1531,
      "b5e8": 1532,
      "g2e2": 1533,
      "f8d7": 1534,
      "c1g1": 1535,
      "h4d4": 1536,
      "d1c3": 1537,
      "g6e8": 1538,
      "g2f4": 1539,
      "a8d5": 1540,
      "f7f2": 1541,
      "a7a4": 1542,
      "e5a5": 1543,
      "a6a4": 1544,
      "h6h8": 1545,
      "e3b3": 1546,
      "d6e8": 1547,
      "e7g8": 1548,
      "a8e4": 1549,
      "f4c4": 1550,
      "b4e1": 1551,
      "b2b6": 1552,
      "e4b1": 1553,
      "h3e3": 1554,
      "h7e4": 1555,
      "g5d5": 1556,
      "c7e8": 1557,
      "b2b7": 1558,
      "a2a5": 1559,
      "e6b6": 1560,
      "h7d3": 1561,
      "c8h8": 1562,
      "c7c1": 1563,
      "h5d5": 1564,
      "b7b2": 1565,
      "f7h6": 1566,
      "b3f3": 1567,
      "h3h1": 1568,
      "b2b5": 1569,
      "f7c4": 1570,
      "b3c1": 1571,
      "a2c3": 1572,
      "a3d3": 1573,
      "d3e1": 1574,
      "c4f4": 1575,
      "h5h2": 1576,
      "a5a8": 1577,
      "a4a1": 1578,
      "e4b4": 1579,
      "c3g3": 1580,
      "a1e5": 1581,
      "c7a6": 1582,
      "b8e5": 1583,
      "c4c1": 1584,
      "c5f5": 1585,
      "c2c8": 1586,
      "d7h7": 1587,
      "f5f8": 1588,
      "h5e8": 1589,
      "c8d6": 1590,
      "e5b5": 1591,
      "b4e4": 1592,
      "h6e6": 1593,
      "g6g8": 1594,
      "a2g2": 1595,
      "e4a8": 1596,
      "g7a1": 1597,
      "e5b8": 1598,
      "c4g4": 1599,
      "b6f6": 1600,
      "h3h7": 1601,
      "g7e6": 1602,
      "e2g1": 1603,
      "e5a1": 1604,
      "c1h1": 1605,
      "b5e5": 1606,
      "c4c8": 1607,
      "d2h2": 1608,
      "g6d6": 1609,
      "f2a2": 1610,
      "b7g7": 1611,
      "f2h3": 1612,
      "c3c8": 1613,
      "f5c5": 1614,
      "f3f8": 1615,
      "b8d6": 1616,
      "b2g2": 1617,
      "f6b6": 1618,
      "g1g8": 1619,
      "a4e4": 1620,
      "g7g4": 1621,
      "f2d1": 1622,
      "g2g5": 1623,
      "e4a4": 1624,
      "f1d2": 1625,
      "h4h1": 1626,
      "h4e1": 1627,
      "e1c2": 1628,
      "f3h1": 1629,
      "e4h1": 1630,
      "a7g7": 1631,
      "c1d3": 1632,
      "e8g7": 1633,
      "h1f3": 1634,
      "a8c7": 1635,
      "g2e3": 1636,
      "h8e5": 1637,
      "g1c1": 1638,
      "c5c1": 1639,
      "h7e7": 1640,
      "h7h4": 1641,
      "d1f2": 1642,
      "b5b8": 1643,
      "f2h1": 1644,
      "f6f1": 1645,
      "d8f7": 1646,
      "c8e7": 1647,
      "a3a6": 1648,
      "b1h1": 1649,
      "c2h7": 1650,
      "f7a7": 1651,
      "d6h6": 1652,
      "b8g8": 1653,
      "g8c8": 1654,
      "g7d7": 1655,
      "f7f1": 1656,
      "c5g5": 1657,
      "c2e1": 1658,
      "a3e3": 1659,
      "g6h8": 1660,
      "c6g6": 1661,
      "f5f1": 1662,
      "a6e6": 1663,
      "c2a3": 1664,
      "e3g1": 1665,
      "e6a6": 1666,
      "b8h8": 1667,
      "e8b5": 1668,
      "a6a3": 1669,
      "c6c1": 1670,
      "e3a3": 1671,
      "f7b3": 1672,
      "a7a3": 1673,
      "a2a6": 1674,
      "g2d2": 1675,
      "a3a7": 1676,
      "b4b1": 1677,
      "f2f8": 1678,
      "a5a1": 1679,
      "g3g1": 1680,
      "c4g8": 1681,
      "h6c1": 1682,
      "h8f7": 1683,
      "b1g1": 1684,
      "h2e2": 1685,
      "f2b6": 1686,
      "a8f3": 1687,
      "a2a7": 1688,
      "g7g3": 1689,
      "f4f8": 1690,
      "a1c2": 1691,
      "h2d6": 1692,
      "h2h5": 1693,
      "b6a8": 1694,
      "h5c5": 1695,
      "a6a2": 1696,
      "b1f5": 1697,
      "c1e2": 1698,
      "a4a8": 1699,
      "g2c2": 1700,
      "g4c4": 1701,
      "c7h7": 1702,
      "a5f5": 1703,
      "e1b4": 1704,
      "h3d3": 1705,
      "a5h5": 1706,
      "a5g5": 1707,
      "g5c5": 1708,
      "g8g1": 1709,
      "g2g6": 1710,
      "a2h2": 1711,
      "a6b8": 1712,
      "h4c4": 1713,
      "h2f1": 1714,
      "b7b1": 1715,
      "e6g8": 1716,
      "c2h2": 1717,
      "g3c3": 1718,
      "b4f4": 1719,
      "g2a8": 1720,
      "g7c7": 1721,
      "h7f8": 1722,
      "c4h4": 1723,
      "g6c6": 1724,
      "a3f3": 1725,
      "a4f4": 1726,
      "h6d6": 1727,
      "a7h7": 1728,
      "h3c8": 1729,
      "b3g3": 1730,
      "c5h5": 1731,
      "g7b7": 1732,
      "b7a5": 1733,
      "a5e1": 1734,
      "g1a1": 1735,
      "b2b8": 1736,
      "g8a8": 1737,
      "c8b6": 1738,
      "c7h2": 1739,
      "b4b8": 1740,
      "b3a1": 1741,
      "h6h2": 1742,
      "g7g2": 1743,
      "a7a2": 1744,
      "g3h1": 1745,
      "a6f6": 1746,
      "c1b3": 1747,
      "a4g4": 1748,
      "c3h3": 1749,
      "h7c7": 1750,
      "h7a7": 1751,
      "a1f6": 1752,
      "f3a3": 1753,
      "h7d7": 1754,
      "g4g1": 1755,
      "b5f5": 1756,
      "f4b4": 1757,
      "h7b7": 1758,
      "b6b1": 1759,
      "b2a4": 1760,
      "b3b8": 1761,
      "f5a5": 1762,
      "h2d2": 1763,
      "g5g8": 1764,
      "g2b2": 1765,
      "a4e8": 1766,
      "g1b1": 1767,
      "g8b8": 1768,
      "g7h5": 1769,
      "b6g6": 1770,
      "h1e4": 1771,
      "d4h8": 1772,
      "h5h1": 1773,
      "g2g7": 1774,
      "a4h4": 1775,
      "h7h3": 1776,
      "h8g6": 1777,
      "h2b2": 1778,
      "f6a6": 1779,
      "b7h7": 1780,
      "a8b6": 1781,
      "b8f4": 1782,
      "h4h8": 1783,
      "h2c2": 1784,
      "a2f7": 1785,
      "f1h2": 1786,
      "b7d8": 1787,
      "d8b7": 1788,
      "h2h6": 1789,
      "b5b1": 1790,
      "b2h2": 1791,
      "a7a1": 1792,
      "h8d4": 1793,
      "f8h7": 1794,
      "e1g2": 1795,
      "g2h4": 1796,
      "c6h6": 1797,
      "a7c8": 1798,
      "h3c3": 1799,
      "f4a4": 1800,
      "d5g8": 1801,
      "a3b1": 1802,
      "a3a8": 1803,
      "e8a4": 1804,
      "h6g8": 1805,
      "h3h8": 1806,
      "h2a2": 1807,
      "g8e6": 1808,
      "e1a5": 1809,
      "d4g1": 1810,
      "g1e3": 1811,
      "b4g4": 1812,
      "a2a8": 1813,
      "a3g3": 1814,
      "b5g5": 1815,
      "f5b5": 1816,
      "h2h7": 1817,
      "c5g1": 1818,
      "a6a1": 1819,
      "d5h1": 1820,
      "g7a7": 1821,
      "g6b1": 1822,
      "a2c1": 1823,
      "g8d5": 1824,
      "g3b3": 1825,
      "a7f2": 1826,
      "b1g6": 1827,
      "h4b4": 1828,
      "a6g6": 1829,
      "b2d1": 1830,
      "h1d5": 1831,
      "g1d4": 1832,
      "g6g1": 1833,
      "g7e8": 1834,
      "g3g8": 1835,
      "g2a2": 1836,
      "g5g1": 1837,
      "g3b8": 1838,
      "g4g8": 1839,
      "b7h1": 1840,
      "b6h6": 1841,
      "g4b4": 1842,
      "a3h3": 1843,
      "a1g7": 1844,
      "a1b3": 1845,
      "h1f2": 1846,
      "a6h6": 1847,
      "h7h2": 1848,
      "h6h1": 1849,
      "g5b5": 1850,
      "b3h3": 1851,
      "g5a5": 1852,
      "b4h4": 1853,
      "h5a5": 1854,
      "d1b2": 1855,
      "g4a4": 1856,
      "h4a4": 1857,
      "c8a7": 1858,
      "b8g3": 1859,
      "h6c6": 1860,
      "f2a7": 1861,
      "h5b5": 1862,
      "g6b6": 1863,
      "a8g2": 1864,
      "b5h5": 1865,
      "c3h8": 1866,
      "h3g1": 1867,
      "h3a3": 1868,
      "c6h1": 1869,
      "c1a2": 1870,
      "g7g1": 1871,
      "b2h8": 1872,
      "h3b3": 1873,
      "h2h8": 1874,
      "h1g3": 1875,
      "g3a3": 1876,
      "h7h1": 1877,
      "h6a6": 1878,
      "g6a6": 1879,
      "g2g8": 1880,
      "g2e1": 1881,
      "h2c7": 1882,
      "f7a2": 1883,
      "b3g8": 1884,
      "h7c2": 1885,
      "g1c5": 1886,
      "h8c3": 1887,
      "b6g1": 1888,
      "h6b6": 1889,
      "h1c6": 1890,
      "g8c4": 1891,
      "b1h7": 1892,
      "h8b2": 1893,
      "h1b7": 1894,
      "g8b3": 1895,
      "b8h2": 1896,
      "e7f8q": 1897,
      "g1b6": 1898,
      "d7e8q": 1899,
      "a1h8": 1900,
      "h2b8": 1901,
      "h7b1": 1902,
      "b7a8q": 1903,
      "g1a7": 1904,
      "a8h1": 1905,
      "h8a1": 1906,
      "g8a2": 1907,
      "e2f1q": 1908,
      "e7d8q": 1909,
      "a2g8": 1910,
      "c7d8q": 1911,
      "c2d1q": 1912,
      "h1a8": 1913,
      "a2b1q": 1914,
      "a7b8q": 1915,
      "b2a1q": 1916,
      "e2d1q": 1917,
      "a7g1": 1918,
      "b7c8q": 1919,
      "g7h8q": 1920,
      "g2f1q": 1921,
      "d7c8q": 1922,
      "g7f8q": 1923,
      "d2e1q": 1924,
      "c7b8q": 1925,
      "h2g1q": 1926,
      "d2c1q": 1927,
      "c2b1q": 1928,
      "f7e8q": 1929,
      "b2c1q": 1930,
      "g2h1q": 1931,
      "a7a8r": 1932,
      "f2e1q": 1933,
      "h7g8q": 1934,
      "f7f8r": 1935,
      "f7g8q": 1936,
      "a2a1r": 1937,
      "d2d1r": 1938,
      "g2g1r": 1939,
      "f2f1r": 1940,
      "c7c8r": 1941,
      "h7h8r": 1942,
      "c2c1r": 1943,
      "g7g8r": 1944,
      "h7h8n": 1945,
      "h2h1r": 1946,
      "f2g1q": 1947,
      "d7d8n": 1948,
      "e2e1r": 1949,
      "d2d1n": 1950,
      "b7b8r": 1951,
      "f7f8n": 1952,
      "g2g1n": 1953,
      "e2e1n": 1954,
      "b2b1r": 1955,
      "h2h1n": 1956,
      "e7e8n": 1957,
      "d7d8r": 1958,
      "a7a8n": 1959,
      "g7g8n": 1960,
      "a2a1b": 1961,
      "f2f1n": 1962,
      "a2a1n": 1963,
      "c7c8n": 1964,
      "b7b8n": 1965,
      "b2b1n": 1966,
      "a7a8b": 1967,
      "c2c1n": 1968,
      "e7e8r": 1969,
      "g2g1b": 1970,
      "c2c1b": 1971,
      "b7b8b": 1972,
      "h2h1b": 1973,
      "f7f8b": 1974,
      "f2g1n": 1975,
      "e7d8r": 1976,
      "e7e8b": 1977,
      "d7d8b": 1978,
      "d7e8r": 1979,
      "d7c8n": 1980,
      "b2b1b": 1981,
      "h7h8b": 1982,
      "g7g8b": 1983,
      "d2d1b": 1984,
      "d2e1r": 1985,
      "c7d8n": 1986
    },
    "merges": [
      [
        "E",
        "P"
      ],
      [
        "S",
        "T"
      ],
      [
        "ST",
        "EP"
      ],
      [
        "f",
        "3"
      ],
      [
        "f",
        "6"
      ],
      [
        "e",
        "5"
      ],
      [
        "d",
        "4"
      ],
      [
        "e",
        "4"
      ],
      [
        "d",
        "5"
      ],
      [
        "e",
        "7"
      ],
      [
        "d",
        "7"
      ],
      [
        "c",
        "6"
      ],
      [
        "e",
        "2"
      ],
      [
        "c",
        "3"
      ],
      [
        "d",
        "2"
      ],
      [
        "c",
        "4"
      ],
      [
        "g",
        "1"
      ],
      [
        "g",
        "8"
      ],
      [
        "c",
        "5"
      ],
      [
        "e",
        "6"
      ],
      [
        "f",
        "1"
      ],
      [
        "f",
        "8"
      ],
      [
        "d",
        "6"
      ],
      [
        "f",
        "4"
      ],
      [
        "g",
        "5"
      ],
      [
        "d",
        "3"
      ],
      [
        "d",
        "8"
      ],
      [
        "e",
        "1"
      ],
      [
        "d",
        "1"
      ],
      [
        "e",
        "3"
      ],
      [
        "g",
        "4"
      ],
      [
        "f",
        "5"
      ],
      [
        "e",
        "8"
      ],
      [
        "c",
        "8"
      ],
      [
        "c",
        "1"
      ],
      [
        "c",
        "7"
      ],
      [
        "b",
        "5"
      ],
      [
        "g",
        "7"
      ],
      [
        "c",
        "2"
      ],
      [
        "b",
        "4"
      ],
      [
        "g",
        "6"
      ],
      [
        "f",
        "7"
      ],
      [
        "f",
        "2"
      ],
      [
        "b",
        "8"
      ],
      [
        "b",
        "7"
      ],
      [
        "g",
        "3"
      ],
      [
        "g",
        "2"
      ],
      [
        "b",
        "1"
      ],
      [
        "b",
        "2"
      ],
      [
        "h",
        "5"
      ],
      [
        "b",
        "6"
      ],
      [
        "h",
        "4"
      ],
      [
        "b",
        "3"
      ],
      [
        "h",
        "6"
      ],
      [
        "h",
        "3"
      ],
      [
        "a",
        "5"
      ],
      [
        "h",
        "2"
      ],
      [
        "a",
        "4"
      ],
      [
        "h",
        "7"
      ],
      [
        "a",
        "6"
      ],
      [
        "a",
        "3"
      ],
      [
        "a",
        "7"
      ],
      [
        "a",
        "8"
      ],
      [
        "a",
        "1"
      ],
      [
        "a",
        "2"
      ],
      [
        "g1",
        "f3"
      ],
      [
        "g8",
        "f6"
      ],
      [
        "h",
        "8"
      ],
      [
        "e2",
        "e4"
      ],
      [
        "d2",
        "d4"
      ],
      [
        "h",
        "1"
      ],
      [
        "e1",
        "g1"
      ],
      [
        "b1",
        "c3"
      ],
      [
        "b8",
        "c6"
      ],
      [
        "e8",
        "g8"
      ],
      [
        "e7",
        "e6"
      ],
      [
        "d7",
        "d5"
      ],
      [
        "d7",
        "d6"
      ],
      [
        "e7",
        "e5"
      ],
      [
        "g7",
        "g6"
      ],
      [
        "h2",
        "h3"
      ],
      [
        "c7",
        "c6"
      ],
      [
        "c2",
        "c3"
      ],
      [
        "h7",
        "h6"
      ],
      [
        "c7",
        "c5"
      ],
      [
        "a7",
        "a6"
      ],
      [
        "f8",
        "e7"
      ],
      [
        "c2",
        "c4"
      ],
      [
        "g2",
        "g3"
      ],
      [
        "e2",
        "e3"
      ],
      [
        "a2",
        "a3"
      ],
      [
        "d2",
        "d3"
      ],
      [
        "f2",
        "f4"
      ],
      [
        "f7",
        "f6"
      ],
      [
        "f3",
        "e5"
      ],
      [
        "f1",
        "e1"
      ],
      [
        "e4",
        "e5"
      ],
      [
        "b7",
        "b6"
      ],
      [
        "f2",
        "f3"
      ],
      [
        "b8",
        "d7"
      ],
      [
        "f1",
        "c4"
      ],
      [
        "b2",
        "b3"
      ],
      [
        "b7",
        "b5"
      ],
      [
        "f1",
        "e2"
      ],
      [
        "f6",
        "e4"
      ],
      [
        "c1",
        "g5"
      ],
      [
        "e4",
        "d5"
      ],
      [
        "f8",
        "e8"
      ],
      [
        "c5",
        "d4"
      ],
      [
        "f8",
        "g7"
      ],
      [
        "b1",
        "d2"
      ],
      [
        "f1",
        "d3"
      ],
      [
        "c1",
        "e3"
      ],
      [
        "f7",
        "f5"
      ],
      [
        "c8",
        "d7"
      ],
      [
        "c8",
        "b7"
      ],
      [
        "c8",
        "g4"
      ],
      [
        "b2",
        "b4"
      ],
      [
        "f3",
        "d4"
      ],
      [
        "d4",
        "d5"
      ],
      [
        "d4",
        "e5"
      ],
      [
        "d1",
        "d2"
      ],
      [
        "c4",
        "d5"
      ],
      [
        "c3",
        "d5"
      ],
      [
        "f6",
        "d5"
      ],
      [
        "e6",
        "d5"
      ],
      [
        "c6",
        "d4"
      ],
      [
        "a2",
        "a4"
      ],
      [
        "g2",
        "g4"
      ],
      [
        "d6",
        "e5"
      ],
      [
        "e6",
        "e5"
      ],
      [
        "e5",
        "d4"
      ],
      [
        "d8",
        "d7"
      ],
      [
        "a7",
        "a5"
      ],
      [
        "h2",
        "h4"
      ],
      [
        "c1",
        "d2"
      ],
      [
        "d1",
        "e2"
      ],
      [
        "d8",
        "e7"
      ],
      [
        "c1",
        "f4"
      ],
      [
        "a1",
        "d1"
      ],
      [
        "c8",
        "e6"
      ],
      [
        "f8",
        "d6"
      ],
      [
        "a8",
        "c8"
      ],
      [
        "f1",
        "g2"
      ],
      [
        "d5",
        "e4"
      ],
      [
        "e7",
        "f6"
      ],
      [
        "c6",
        "c5"
      ],
      [
        "c3",
        "e4"
      ],
      [
        "h7",
        "h5"
      ],
      [
        "d6",
        "d5"
      ],
      [
        "c6",
        "e5"
      ],
      [
        "e5",
        "e4"
      ],
      [
        "a8",
        "d8"
      ],
      [
        "g1",
        "h1"
      ],
      [
        "f8",
        "c5"
      ],
      [
        "g7",
        "f6"
      ],
      [
        "e1",
        "c1"
      ],
      [
        "c1",
        "b2"
      ],
      [
        "g7",
        "g5"
      ],
      [
        "d8",
        "c7"
      ],
      [
        "a1",
        "c1"
      ],
      [
        "b7",
        "c6"
      ],
      [
        "d5",
        "d4"
      ],
      [
        "g8",
        "e7"
      ],
      [
        "f3",
        "g5"
      ],
      [
        "h4",
        "h5"
      ],
      [
        "f4",
        "e5"
      ],
      [
        "b2",
        "c3"
      ],
      [
        "g5",
        "f6"
      ],
      [
        "g8",
        "g7"
      ],
      [
        "g8",
        "h8"
      ],
      [
        "d1",
        "f3"
      ],
      [
        "f1",
        "b5"
      ],
      [
        "f4",
        "f5"
      ],
      [
        "c8",
        "f5"
      ],
      [
        "e8",
        "c8"
      ],
      [
        "c3",
        "c4"
      ],
      [
        "f8",
        "b4"
      ],
      [
        "g4",
        "f3"
      ],
      [
        "e3",
        "e4"
      ],
      [
        "g2",
        "f3"
      ],
      [
        "e3",
        "d4"
      ],
      [
        "c6",
        "d5"
      ],
      [
        "a8",
        "b8"
      ],
      [
        "g4",
        "g5"
      ],
      [
        "g6",
        "g5"
      ],
      [
        "b5",
        "b4"
      ],
      [
        "d3",
        "e4"
      ],
      [
        "e2",
        "f3"
      ],
      [
        "d3",
        "d4"
      ],
      [
        "f3",
        "f4"
      ],
      [
        "c3",
        "d4"
      ],
      [
        "g1",
        "g2"
      ],
      [
        "h3",
        "h4"
      ],
      [
        "a1",
        "b1"
      ],
      [
        "f6",
        "f5"
      ],
      [
        "g3",
        "g4"
      ],
      [
        "c4",
        "c5"
      ],
      [
        "c5",
        "c4"
      ],
      [
        "a5",
