{
    "a1a2": 0,
    "a1a3": 1,
    "a1a4": 2,
    "a1a5": 3,
    "a1a6": 4,
    "a1a7": 5,
    "a1a8": 6,
    "a1b1": 7,
    "a1b2": 8,
    "a1b3": 9,
    "a1c1": 10,
    "a1c2": 11,
    "a1c3": 12,
    "a1d1": 13,
    "a1d4": 14,
    "a1e1": 15,
    "a1e5": 16,
    "a1f1": 17,
    "a1f6": 18,
    "a1g1": 19,
    "a1g7": 20,
    "a1h1": 21,
    "a1h8": 22,
    "a2a1": 23,
    "a2a1b": 24,
    "a2a1n": 25,
    "a2a1q": 26,
    "a2a1r": 27,
    "a2a3": 28,
    "a2a4": 29,
    "a2a5": 30,
    "a2a6": 31,
    "a2a7": 32,
    "a2a8": 33,
    "a2b1": 34,
    "a2b2": 35,
    "a2b3": 36,
    "a2b4": 37,
    "a2c1": 38,
    "a2c2": 39,
    "a2c3": 40,
    "a2c4": 41,
    "a2d2": 42,
    "a2d5": 43,
    "a2e2": 44,
    "a2e6": 45,
    "a2f2": 46,
    "a2f7": 47,
    "a2g2": 48,
    "a2g8": 49,
    "a2h2": 50,
    "a3a1": 51,
    "a3a2": 52,
    "a3a4": 53,
    "a3a5": 54,
    "a3a6": 55,
    "a3a7": 56,
    "a3a8": 57,
    "a3b1": 58,
    "a3b2": 59,
    "a3b3": 60,
    "a3b4": 61,
    "a3b5": 62,
    "a3c1": 63,
    "a3c2": 64,
    "a3c3": 65,
    "a3c4": 66,
    "a3c5": 67,
    "a3d3": 68,
    "a3d6": 69,
    "a3e3": 70,
    "a3e7": 71,
    "a3f3": 72,
    "a3f8": 73,
    "a3g3": 74,
    "a3h3": 75,
    "a4a1": 76,
    "a4a2": 77,
    "a4a3": 78,
    "a4a5": 79,
    "a4a6": 80,
    "a4a7": 81,
    "a4a8": 82,
    "a4b2": 83,
    "a4b3": 84,
    "a4b4": 85,
    "a4b5": 86,
    "a4b6": 87,
    "a4c2": 88,
    "a4c3": 89,
    "a4c4": 90,
    "a4c5": 91,
    "a4c6": 92,
    "a4d1": 93,
    "a4d4": 94,
    "a4d7": 95,
    "a4e4": 96,
    "a4e8": 97,
    "a4f4": 98,
    "a4g4": 99,
    "a4h4": 100,
    "a5a1": 101,
    "a5a2": 102,
    "a5a3": 103,
    "a5a4": 104,
    "a5a6": 105,
    "a5a7": 106,
    "a5a8": 107,
    "a5b3": 108,
    "a5b4": 109,
    "a5b5": 110,
    "a5b6": 111,
    "a5b7": 112,
    "a5c3": 113,
    "a5c4": 114,
    "a5c5": 115,
    "a5c6": 116,
    "a5c7": 117,
    "a5d2": 118,
    "a5d5": 119,
    "a5d8": 120,
    "a5e1": 121,
    "a5e5": 122,
    "a5f5": 123,
    "a5g5": 124,
    "a5h5": 125,
    "a6a1": 126,
    "a6a2": 127,
    "a6a3": 128,
    "a6a4": 129,
    "a6a5": 130,
    "a6a7": 131,
    "a6a8": 132,
    "a6b4": 133,
    "a6b5": 134,
    "a6b6": 135,
    "a6b7": 136,
    "a6b8": 137,
    "a6c4": 138,
    "a6c5": 139,
    "a6c6": 140,
    "a6c7": 141,
    "a6c8": 142,
    "a6d3": 143,
    "a6d6": 144,
    "a6e2": 145,
    "a6e6": 146,
    "a6f1": 147,
    "a6f6": 148,
    "a6g6": 149,
    "a6h6": 150,
    "a7a1": 151,
    "a7a2": 152,
    "a7a3": 153,
    "a7a4": 154,
    "a7a5": 155,
    "a7a6": 156,
    "a7a8": 157,
    "a7a8b": 158,
    "a7a8n": 159,
    "a7a8q": 160,
    "a7a8r": 161,
    "a7b5": 162,
    "a7b6": 163,
    "a7b7": 164,
    "a7b8": 165,
    "a7c5": 166,
    "a7c6": 167,
    "a7c7": 168,
    "a7c8": 169,
    "a7d4": 170,
    "a7d7": 171,
    "a7e3": 172,
    "a7e7": 173,
    "a7f2": 174,
    "a7f7": 175,
    "a7g1": 176,
    "a7g7": 177,
    "a7h7": 178,
    "a8a1": 179,
    "a8a2": 180,
    "a8a3": 181,
    "a8a4": 182,
    "a8a5": 183,
    "a8a6": 184,
    "a8a7": 185,
    "a8b6": 186,
    "a8b7": 187,
    "a8b8": 188,
    "a8c6": 189,
    "a8c7": 190,
    "a8c8": 191,
    "a8d5": 192,
    "a8d8": 193,
    "a8e4": 194,
    "a8e8": 195,
    "a8f3": 196,
    "a8f8": 197,
    "a8g2": 198,
    "a8g8": 199,
    "a8h1": 200,
    "a8h8": 201,
    "b1a1": 202,
    "b1a2": 203,
    "b1a3": 204,
    "b1b2": 205,
    "b1b3": 206,
    "b1b4": 207,
    "b1b5": 208,
    "b1b6": 209,
    "b1b7": 210,
    "b1b8": 211,
    "b1c1": 212,
    "b1c2": 213,
    "b1c3": 214,
    "b1d1": 215,
    "b1d2": 216,
    "b1d3": 217,
    "b1e1": 218,
    "b1e4": 219,
    "b1f1": 220,
    "b1f5": 221,
    "b1g1": 222,
    "b1g6": 223,
    "b1h1": 224,
    "b1h7": 225,
    "b2a1": 226,
    "b2a2": 227,
    "b2a3": 228,
    "b2a4": 229,
    "b2b1": 230,
    "b2b1b": 231,
    "b2b1n": 232,
    "b2b1q": 233,
    "b2b1r": 234,
    "b2b3": 235,
    "b2b4": 236,
    "b2b5": 237,
    "b2b6": 238,
    "b2b7": 239,
    "b2b8": 240,
    "b2c1": 241,
    "b2c2": 242,
    "b2c3": 243,
    "b2c4": 244,
    "b2d1": 245,
    "b2d2": 246,
    "b2d3": 247,
    "b2d4": 248,
    "b2e2": 249,
    "b2e5": 250,
    "b2f2": 251,
    "b2f6": 252,
    "b2g2": 253,
    "b2g7": 254,
    "b2h2": 255,
    "b2h8": 256,
    "b3a1": 257,
    "b3a2": 258,
    "b3a3": 259,
    "b3a4": 260,
    "b3a5": 261,
    "b3b1": 262,
    "b3b2": 263,
    "b3b4": 264,
    "b3b5": 265,
    "b3b6": 266,
    "b3b7": 267,
    "b3b8": 268,
    "b3c1": 269,
    "b3c2": 270,
    "b3c3": 271,
    "b3c4": 272,
    "b3c5": 273,
    "b3d1": 274,
    "b3d2": 275,
    "b3d3": 276,
    "b3d4": 277,
    "b3d5": 278,
    "b3e3": 279,
    "b3e6": 280,
    "b3f3": 281,
    "b3f7": 282,
    "b3g3": 283,
    "b3g8": 284,
    "b3h3": 285,
    "b4a2": 286,
    "b4a3": 287,
    "b4a4": 288,
    "b4a5": 289,
    "b4a6": 290,
    "b4b1": 291,
    "b4b2": 292,
    "b4b3": 293,
    "b4b5": 294,
    "b4b6": 295,
    "b4b7": 296,
    "b4b8": 297,
    "b4c2": 298,
    "b4c3": 299,
    "b4c4": 300,
    "b4c5": 301,
    "b4c6": 302,
    "b4d2": 303,
    "b4d3": 304,
    "b4d4": 305,
    "b4d5": 306,
    "b4d6": 307,
    "b4e1": 308,
    "b4e4": 309,
    "b4e7": 310,
    "b4f4": 311,
    "b4f8": 312,
    "b4g4": 313,
    "b4h4": 314,
    "b5a3": 315,
    "b5a4": 316,
    "b5a5": 317,
    "b5a6": 318,
    "b5a7": 319,
    "b5b1": 320,
    "b5b2": 321,
    "b5b3": 322,
    "b5b4": 323,
    "b5b6": 324,
    "b5b7": 325,
    "b5b8": 326,
    "b5c3": 327,
    "b5c4": 328,
    "b5c5": 329,
    "b5c6": 330,
    "b5c7": 331,
    "b5d3": 332,
    "b5d4": 333,
    "b5d5": 334,
    "b5d6": 335,
    "b5d7": 336,
    "b5e2": 337,
    "b5e5": 338,
    "b5e8": 339,
    "b5f1": 340,
    "b5f5": 341,
    "b5g5": 342,
    "b5h5": 343,
    "b6a4": 344,
    "b6a5": 345,
    "b6a6": 346,
    "b6a7": 347,
    "b6a8": 348,
    "b6b1": 349,
    "b6b2": 350,
    "b6b3": 351,
    "b6b4": 352,
    "b6b5": 353,
    "b6b7": 354,
    "b6b8": 355,
    "b6c4": 356,
    "b6c5": 357,
    "b6c6": 358,
    "b6c7": 359,
    "b6c8": 360,
    "b6d4": 361,
    "b6d5": 362,
    "b6d6": 363,
    "b6d7": 364,
    "b6d8": 365,
    "b6e3": 366,
    "b6e6": 367,
    "b6f2": 368,
    "b6f6": 369,
    "b6g1": 370,
    "b6g6": 371,
    "b6h6": 372,
    "b7a5": 373,
    "b7a6": 374,
    "b7a7": 375,
    "b7a8": 376,
    "b7b1": 377,
    "b7b2": 378,
    "b7b3": 379,
    "b7b4": 380,
    "b7b5": 381,
    "b7b6": 382,
    "b7b8": 383,
    "b7b8b": 384,
    "b7b8n": 385,
    "b7b8q": 386,
    "b7b8r": 387,
    "b7c5": 388,
    "b7c6": 389,
    "b7c7": 390,
    "b7c8": 391,
    "b7d5": 392,
    "b7d6": 393,
    "b7d7": 394,
    "b7d8": 395,
    "b7e4": 396,
    "b7e7": 397,
    "b7f3": 398,
    "b7f7": 399,
    "b7g2": 400,
    "b7g7": 401,
    "b7h1": 402,
    "b7h7": 403,
    "b8a6": 404,
    "b8a7": 405,
    "b8a8": 406,
    "b8b1": 407,
    "b8b2": 408,
    "b8b3": 409,
    "b8b4": 410,
    "b8b5": 411,
    "b8b6": 412,
    "b8b7": 413,
    "b8c6": 414,
    "b8c7": 415,
    "b8c8": 416,
    "b8d6": 417,
    "b8d7": 418,
    "b8d8": 419,
    "b8e5": 420,
    "b8e8": 421,
    "b8f4": 422,
    "b8f8": 423,
    "b8g3": 424,
    "b8g8": 425,
    "b8h2": 426,
    "b8h8": 427,
    "c1a1": 428,
    "c1a2": 429,
    "c1a3": 430,
    "c1b1": 431,
    "c1b2": 432,
    "c1b3": 433,
    "c1c2": 434,
    "c1c3": 435,
    "c1c4": 436,
    "c1c5": 437,
    "c1c6": 438,
    "c1c7": 439,
    "c1c8": 440,
    "c1d1": 441,
    "c1d2": 442,
    "c1d3": 443,
    "c1e1": 444,
    "c1e2": 445,
    "c1e3": 446,
    "c1f1": 447,
    "c1f4": 448,
    "c1g1": 449,
    "c1g5": 450,
    "c1h1": 451,
    "c1h6": 452,
    "c2a1": 453,
    "c2a2": 454,
    "c2a3": 455,
    "c2a4": 456,
    "c2b1": 457,
    "c2b2": 458,
    "c2b3": 459,
    "c2b4": 460,
    "c2c1": 461,
    "c2c1b": 462,
    "c2c1n": 463,
    "c2c1q": 464,
    "c2c1r": 465,
    "c2c3": 466,
    "c2c4": 467,
    "c2c5": 468,
    "c2c6": 469,
    "c2c7": 470,
    "c2c8": 471,
    "c2d1": 472,
    "c2d2": 473,
    "c2d3": 474,
    "c2d4": 475,
    "c2e1": 476,
    "c2e2": 477,
    "c2e3": 478,
    "c2e4": 479,
    "c2f2": 480,
    "c2f5": 481,
    "c2g2": 482,
    "c2g6": 483,
    "c2h2": 484,
    "c2h7": 485,
    "c3a1": 486,
    "c3a2": 487,
    "c3a3": 488,
    "c3a4": 489,
    "c3a5": 490,
    "c3b1": 491,
    "c3b2": 492,
    "c3b3": 493,
    "c3b4": 494,
    "c3b5": 495,
    "c3c1": 496,
    "c3c2": 497,
    "c3c4": 498,
    "c3c5": 499,
    "c3c6": 500,
    "c3c7": 501,
    "c3c8": 502,
    "c3d1": 503,
    "c3d2": 504,
    "c3d3": 505,
    "c3d4": 506,
    "c3d5": 507,
    "c3e1": 508,
    "c3e2": 509,
    "c3e3": 510,
    "c3e4": 511,
    "c3e5": 512,
    "c3f3": 513,
    "c3f6": 514,
    "c3g3": 515,
    "c3g7": 516,
    "c3h3": 517,
    "c3h8": 518,
    "c4a2": 519,
    "c4a3": 520,
    "c4a4": 521,
    "c4a5": 522,
    "c4a6": 523,
    "c4b2": 524,
    "c4b3": 525,
    "c4b4": 526,
    "c4b5": 527,
    "c4b6": 528,
    "c4c1": 529,
    "c4c2": 530,
    "c4c3": 531,
    "c4c5": 532,
    "c4c6": 533,
    "c4c7": 534,
    "c4c8": 535,
    "c4d2": 536,
    "c4d3": 537,
    "c4d4": 538,
    "c4d5": 539,
    "c4d6": 540,
    "c4e2": 541,
    "c4e3": 542,
    "c4e4": 543,
    "c4e5": 544,
    "c4e6": 545,
    "c4f1": 546,
    "c4f4": 547,
    "c4f7": 548,
    "c4g4": 549,
    "c4g8": 550,
    "c4h4": 551,
    "c5a3": 552,
    "c5a4": 553,
    "c5a5": 554,
    "c5a6": 555,
    "c5a7": 556,
    "c5b3": 557,
    "c5b4": 558,
    "c5b5": 559,
    "c5b6": 560,
    "c5b7": 561,
    "c5c1": 562,
    "c5c2": 563,
    "c5c3": 564,
    "c5c4": 565,
    "c5c6": 566,
    "c5c7": 567,
    "c5c8": 568,
    "c5d3": 569,
    "c5d4": 570,
    "c5d5": 571,
    "c5d6": 572,
    "c5d7": 573,
    "c5e3": 574,
    "c5e4": 575,
    "c5e5": 576,
    "c5e6": 577,
    "c5e7": 578,
    "c5f2": 579,
    "c5f5": 580,
    "c5f8": 581,
    "c5g1": 582,
    "c5g5": 583,
    "c5h5": 584,
    "c6a4": 585,
    "c6a5": 586,
    "c6a6": 587,
    "c6a7": 588,
    "c6a8": 589,
    "c6b4": 590,
    "c6b5": 591,
    "c6b6": 592,
    "c6b7": 593,
    "c6b8": 594,
    "c6c1": 595,
    "c6c2": 596,
    "c6c3": 597,
    "c6c4": 598,
    "c6c5": 599,
    "c6c7": 600,
    "c6c8": 601,
    "c6d4": 602,
    "c6d5": 603,
    "c6d6": 604,
    "c6d7": 605,
    "c6d8": 606,
    "c6e4": 607,
    "c6e5": 608,
    "c6e6": 609,
    "c6e7": 610,
    "c6e8": 611,
    "c6f3": 612,
    "c6f6": 613,
    "c6g2": 614,
    "c6g6": 615,
    "c6h1": 616,
    "c6h6": 617,
    "c7a5": 618,
    "c7a6": 619,
    "c7a7": 620,
    "c7a8": 621,
    "c7b5": 622,
    "c7b6": 623,
    "c7b7": 624,
    "c7b8": 625,
    "c7c1": 626,
    "c7c2": 627,
    "c7c3": 628,
    "c7c4": 629,
    "c7c5": 630,
    "c7c6": 631,
    "c7c8": 632,
    "c7c8b": 633,
    "c7c8n": 634,
    "c7c8q": 635,
    "c7c8r": 636,
    "c7d5": 637,
    "c7d6": 638,
    "c7d7": 639,
    "c7d8": 640,
    "c7e5": 641,
    "c7e6": 642,
    "c7e7": 643,
    "c7e8": 644,
    "c7f4": 645,
    "c7f7": 646,
    "c7g3": 647,
    "c7g7": 648,
    "c7h2": 649,
    "c7h7": 650,
    "c8a6": 651,
    "c8a7": 652,
    "c8a8": 653,
    "c8b6": 654,
    "c8b7": 655,
    "c8b8": 656,
    "c8c1": 657,
    "c8c2": 658,
    "c8c3": 659,
    "c8c4": 660,
    "c8c5": 661,
    "c8c6": 662,
    "c8c7": 663,
    "c8d6": 664,
    "c8d7": 665,
    "c8d8": 666,
    "c8e6": 667,
    "c8e7": 668,
    "c8e8": 669,
    "c8f5": 670,
    "c8f8": 671,
    "c8g4": 672,
    "c8g8": 673,
    "c8h3": 674,
    "c8h8": 675,
    "d1a1": 676,
    "d1a4": 677,
    "d1b1": 678,
    "d1b2": 679,
    "d1b3": 680,
    "d1c1": 681,
    "d1c2": 682,
    "d1c3": 683,
    "d1d2": 684,
    "d1d3": 685,
    "d1d4": 686,
    "d1d5": 687,
    "d1d6": 688,
    "d1d7": 689,
    "d1d8": 690,
    "d1e1": 691,
    "d1e2": 692,
    "d1e3": 693,
    "d1f1": 694,
    "d1f2": 695,
    "d1f3": 696,
    "d1g1": 697,
    "d1g4": 698,
    "d1h1": 699,
    "d1h5": 700,
    "d2a2": 701,
    "d2a5": 702,
    "d2b1": 703,
    "d2b2": 704,
    "d2b3": 705,
    "d2b4": 706,
    "d2c1": 707,
    "d2c2": 708,
    "d2c3": 709,
    "d2c4": 710,
    "d2d1": 711,
    "d2d1b": 712,
    "d2d1n": 713,
    "d2d1q": 714,
    "d2d1r": 715,
    "d2d3": 716,
    "d2d4": 717,
    "d2d5": 718,
    "d2d6": 719,
    "d2d7": 720,
    "d2d8": 721,
    "d2e1": 722,
    "d2e2": 723,
    "d2e3": 724,
    "d2e4": 725,
    "d2f1": 726,
    "d2f2": 727,
    "d2f3": 728,
    "d2f4": 729,
    "d2g2": 730,
    "d2g5": 731,
    "d2h2": 732,
    "d2h6": 733,
    "d3a3": 734,
    "d3a6": 735,
    "d3b1": 736,
    "d3b2": 737,
    "d3b3": 738,
    "d3b4": 739,
    "d3b5": 740,
    "d3c1": 741,
    "d3c2": 742,
    "d3c3": 743,
    "d3c4": 744,
    "d3c5": 745,
    "d3d1": 746,
    "d3d2": 747,
    "d3d4": 748,
    "d3d5": 749,
    "d3d6": 750,
    "d3d7": 751,
    "d3d8": 752,
    "d3e1": 753,
    "d3e2": 754,
    "d3e3": 755,
    "d3e4": 756,
    "d3e5": 757,
    "d3f1": 758,
    "d3f2": 759,
    "d3f3": 760,
    "d3f4": 761,
    "d3f5": 762,
    "d3g3": 763,
    "d3g6": 764,
    "d3h3": 765,
    "d3h7": 766,
    "d4a1": 767,
    "d4a4": 768,
    "d4a7": 769,
    "d4b2": 770,
    "d4b3": 771,
    "d4b4": 772,
    "d4b5": 773,
    "d4b6": 774,
    "d4c2": 775,
    "d4c3": 776,
    "d4c4": 777,
    "d4c5": 778,
    "d4c6": 779,
    "d4d1": 780,
    "d4d2": 781,
    "d4d3": 782,
    "d4d5": 783,
    "d4d6": 784,
    "d4d7": 785,
    "d4d8": 786,
    "d4e2": 787,
    "d4e3": 788,
    "d4e4": 789,
    "d4e5": 790,
    "d4e6": 791,
    "d4f2": 792,
    "d4f3": 793,
    "d4f4": 794,
    "d4f5": 795,
    "d4f6": 796,
    "d4g1": 797,
    "d4g4": 798,
    "d4g7": 799,
    "d4h4": 800,
    "d4h8": 801,
    "d5a2": 802,
    "d5a5": 803,
    "d5a8": 804,
    "d5b3": 805,
    "d5b4": 806,
    "d5b5": 807,
    "d5b6": 808,
    "d5b7": 809,
    "d5c3": 810,
    "d5c4": 811,
    "d5c5": 812,
    "d5c6": 813,
    "d5c7": 814,
    "d5d1": 815,
    "d5d2": 816,
    "d5d3": 817,
    "d5d4": 818,
    "d5d6": 819,
    "d5d7": 820,
    "d5d8": 821,
    "d5e3": 822,
    "d5e4": 823,
    "d5e5": 824,
    "d5e6": 825,
    "d5e7": 826,
    "d5f3": 827,
    "d5f4": 828,
    "d5f5": 829,
    "d5f6": 830,
    "d5f7": 831,
    "d5g2": 832,
    "d5g5": 833,
    "d5g8": 834,
    "d5h1": 835,
    "d5h5": 836,
    "d6a3": 837,
    "d6a6": 838,
    "d6b4": 839,
    "d6b5": 840,
    "d6b6": 841,
    "d6b7": 842,
    "d6b8": 843,
    "d6c4": 844,
    "d6c5": 845,
    "d6c6": 846,
    "d6c7": 847,
    "d6c8": 848,
    "d6d1": 849,
    "d6d2": 850,
    "d6d3": 851,
    "d6d4": 852,
    "d6d5": 853,
    "d6d7": 854,
    "d6d8": 855,
    "d6e4": 856,
    "d6e5": 857,
    "d6e6": 858,
    "d6e7": 859,
    "d6e8": 860,
    "d6f4": 861,
    "d6f5": 862,
    "d6f6": 863,
    "d6f7": 864,
    "d6f8": 865,
    "d6g3": 866,
    "d6g6": 867,
    "d6h2": 868,
    "d6h6": 869,
    "d7a4": 870,
    "d7a7": 871,
    "d7b5": 872,
    "d7b6": 873,
    "d7b7": 874,
    "d7b8": 875,
    "d7c5": 876,
    "d7c6": 877,
    "d7c7": 878,
    "d7c8": 879,
    "d7d1": 880,
    "d7d2": 881,
    "d7d3": 882,
    "d7d4": 883,
    "d7d5": 884,
    "d7d6": 885,
    "d7d8": 886,
    "d7d8b": 887,
    "d7d8n": 888,
    "d7d8q": 889,
    "d7d8r": 890,
    "d7e5": 891,
    "d7e6": 892,
    "d7e7": 893,
    "d7e8": 894,
    "d7f5": 895,
    "d7f6": 896,
    "d7f7": 897,
    "d7f8": 898,
    "d7g4": 899,
    "d7g7": 900,
    "d7h3": 901,
    "d7h7": 902,
    "d8a5": 903,
    "d8a8": 904,
    "d8b6": 905,
    "d8b7": 906,
    "d8b8": 907,
    "d8c6": 908,
    "d8c7": 909,
    "d8c8": 910,
    "d8d1": 911,
    "d8d2": 912,
    "d8d3": 913,
    "d8d4": 914,
    "d8d5": 915,
    "d8d6": 916,
    "d8d7": 917,
    "d8e6": 918,
    "d8e7": 919,
    "d8e8": 920,
    "d8f6": 921,
    "d8f7": 922,
    "d8f8": 923,
    "d8g5": 924,
    "d8g8": 925,
    "d8h4": 926,
    "d8h8": 927,
    "e1a1": 928,
    "e1a5": 929,
    "e1b1": 930,
    "e1b4": 931,
    "e1c1": 932,
    "e1c2": 933,
    "e1c3": 934,
    "e1d1": 935,
    "e1d2": 936,
    "e1d3": 937,
    "e1e2": 938,
    "e1e3": 939,
    "e1e4": 940,
    "e1e5": 941,
    "e1e6": 942,
    "e1e7": 943,
    "e1e8": 944,
    "e1f1": 945,
    "e1f2": 946,
    "e1f3": 947,
    "e1g1": 948,
    "e1g2": 949,
    "e1g3": 950,
    "e1h1": 951,
    "e1h4": 952,
    "e2a2": 953,
    "e2a6": 954,
    "e2b2": 955,
    "e2b5": 956,
    "e2c1": 957,
    "e2c2": 958,
    "e2c3": 959,
    "e2c4": 960,
    "e2d1": 961,
    "e2d2": 962,
    "e2d3": 963,
    "e2d4": 964,
    "e2e1": 965,
    "e2e1b": 966,
    "e2e1n": 967,
    "e2e1q": 968,
    "e2e1r": 969,
    "e2e3": 970,
    "e2e4": 971,
    "e2e5": 972,
    "e2e6": 973,
    "e2e7": 974,
    "e2e8": 975,
    "e2f1": 976,
    "e2f2": 977,
    "e2f3": 978,
    "e2f4": 979,
    "e2g1": 980,
    "e2g2": 981,
    "e2g3": 982,
    "e2g4": 983,
    "e2h2": 984,
    "e2h5": 985,
    "e3a3": 986,
    "e3a7": 987,
    "e3b3": 988,
    "e3b6": 989,
    "e3c1": 990,
    "e3c2": 991,
    "e3c3": 992,
    "e3c4": 993,
    "e3c5": 994,
    "e3d1": 995,
    "e3d2": 996,
    "e3d3": 997,
    "e3d4": 998,
    "e3d5": 999,
    "e3e1": 1000,
    "e3e2": 1001,
    "e3e4": 1002,
    "e3e5": 1003,
    "e3e6": 1004,
    "e3e7": 1005,
    "e3e8": 1006,
    "e3f1": 1007,
    "e3f2": 1008,
    "e3f3": 1009,
    "e3f4": 1010,
    "e3f5": 1011,
    "e3g1": 1012,
    "e3g2": 1013,
    "e3g3": 1014,
    "e3g4": 1015,
    "e3g5": 1016,
    "e3h3": 1017,
    "e3h6": 1018,
    "e4a4": 1019,
    "e4a8": 1020,
    "e4b1": 1021,
    "e4b4": 1022,
    "e4b7": 1023,
    "e4c2": 1024,
    "e4c3": 1025,
    "e4c4": 1026,
    "e4c5": 1027,
    "e4c6": 1028,
    "e4d2": 1029,
    "e4d3": 1030,
    "e4d4": 1031,
    "e4d5": 1032,
    "e4d6": 1033,
    "e4e1": 1034,
    "e4e2": 1035,
    "e4e3": 1036,
    "e4e5": 1037,
    "e4e6": 1038,
    "e4e7": 1039,
    "e4e8": 1040,
    "e4f2": 1041,
    "e4f3": 1042,
    "e4f4": 1043,
    "e4f5": 1044,
    "e4f6": 1045,
    "e4g2": 1046,
    "e4g3": 1047,
    "e4g4": 1048,
    "e4g5": 1049,
    "e4g6": 1050,
    "e4h1": 1051,
    "e4h4": 1052,
    "e4h7": 1053,
    "e5a1": 1054,
    "e5a5": 1055,
    "e5b2": 1056,
    "e5b5": 1057,
    "e5b8": 1058,
    "e5c3": 1059,
    "e5c4": 1060,
    "e5c5": 1061,
    "e5c6": 1062,
    "e5c7": 1063,
    "e5d3": 1064,
    "e5d4": 1065,
    "e5d5": 1066,
    "e5d6": 1067,
    "e5d7": 1068,
    "e5e1": 1069,
    "e5e2": 1070,
    "e5e3": 1071,
    "e5e4": 1072,
    "e5e6": 1073,
    "e5e7": 1074,
    "e5e8": 1075,
    "e5f3": 1076,
    "e5f4": 1077,
    "e5f5": 1078,
    "e5f6": 1079,
    "e5f7": 1080,
    "e5g3": 1081,
    "e5g4": 1082,
    "e5g5": 1083,
    "e5g6": 1084,
    "e5g7": 1085,
    "e5h2": 1086,
    "e5h5": 1087,
    "e5h8": 1088,
    "e6a2": 1089,
    "e6a6": 1090,
    "e6b3": 1091,
    "e6b6": 1092,
    "e6c4": 1093,
    "e6c5": 1094,
    "e6c6": 1095,
    "e6c7": 1096,
    "e6c8": 1097,
    "e6d4": 1098,
    "e6d5": 1099,
    "e6d6": 1100,
    "e6d7": 1101,
    "e6d8": 1102,
    "e6e1": 1103,
    "e6e2": 1104,
    "e6e3": 1105,
    "e6e4": 1106,
    "e6e5": 1107,
    "e6e7": 1108,
    "e6e8": 1109,
    "e6f4": 1110,
    "e6f5": 1111,
    "e6f6": 1112,
    "e6f7": 1113,
    "e6f8": 1114,
    "e6g4": 1115,
    "e6g5": 1116,
    "e6g6": 1117,
    "e6g7": 1118,
    "e6g8": 1119,
    "e6h3": 1120,
    "e6h6": 1121,
    "e7a3": 1122,
    "e7a7": 1123,
    "e7b4": 1124,
    "e7b7": 1125,
    "e7c5": 1126,
    "e7c6": 1127,
    "e7c7": 1128,
    "e7c8": 1129,
    "e7d5": 1130,
    "e7d6": 1131,
    "e7d7": 1132,
    "e7d8": 1133,
    "e7e1": 1134,
    "e7e2": 1135,
    "e7e3": 1136,
    "e7e4": 1137,
    "e7e5": 1138,
    "e7e6": 1139,
    "e7e8": 1140,
    "e7e8b": 1141,
    "e7e8n": 1142,
    "e7e8q": 1143,
    "e7e8r": 1144,
    "e7f5": 1145,
    "e7f6": 1146,
    "e7f7": 1147,
    "e7f8": 1148,
    "e7g5": 1149,
    "e7g6": 1150,
    "e7g7": 1151,
    "e7g8": 1152,
    "e7h4": 1153,
    "e7h7": 1154,
    "e8a4": 1155,
    "e8a8": 1156,
    "e8b5": 1157,
    "e8b8": 1158,
    "e8c6": 1159,
    "e8c7": 1160,
    "e8c8": 1161,
    "e8d6": 1162,
    "e8d7": 1163,
    "e8d8": 1164,
    "e8e1": 1165,
    "e8e2": 1166,
    "e8e3": 1167,
    "e8e4": 1168,
    "e8e5": 1169,
    "e8e6": 1170,
    "e8e7": 1171,
    "e8f6": 1172,
    "e8f7": 1173,
    "e8f8": 1174,
    "e8g6": 1175,
    "e8g7": 1176,
    "e8g8": 1177,
    "e8h5": 1178,
    "e8h8": 1179,
    "f1a1": 1180,
    "f1a6": 1181,
    "f1b1": 1182,
    "f1b5": 1183,
    "f1c1": 1184,
    "f1c4": 1185,
    "f1d1": 1186,
    "f1d2": 1187,
    "f1d3": 1188,
    "f1e1": 1189,
    "f1e2": 1190,
    "f1e3": 1191,
    "f1f2": 1192,
    "f1f3": 1193,
    "f1f4": 1194,
    "f1f5": 1195,
    "f1f6": 1196,
    "f1f7": 1197,
    "f1f8": 1198,
    "f1g1": 1199,
    "f1g2": 1200,
    "f1g3": 1201,
    "f1h1": 1202,
    "f1h2": 1203,
    "f1h3": 1204,
    "f2a2": 1205,
    "f2a7": 1206,
    "f2b2": 1207,
    "f2b6": 1208,
    "f2c2": 1209,
    "f2c5": 1210,
    "f2d1": 1211,
    "f2d2": 1212,
    "f2d3": 1213,
    "f2d4": 1214,
    "f2e1": 1215,
    "f2e2": 1216,
    "f2e3": 1217,
    "f2e4": 1218,
    "f2f1": 1219,
    "f2f1b": 1220,
    "f2f1n": 1221,
    "f2f1q": 1222,
    "f2f1r": 1223,
    "f2f3": 1224,
    "f2f4": 1225,
    "f2f5": 1226,
    "f2f6": 1227,
    "f2f7": 1228,
    "f2f8": 1229,
    "f2g1": 1230,
    "f2g2": 1231,
    "f2g3": 1232,
    "f2g4": 1233,
    "f2h1": 1234,
    "f2h2": 1235,
    "f2h3": 1236,
    "f2h4": 1237,
    "f3a3": 1238,
    "f3a8": 1239,
    "f3b3": 1240,
    "f3b7": 1241,
    "f3c3": 1242,
    "f3c6": 1243,
    "f3d1": 1244,
    "f3d2": 1245,
    "f3d3": 1246,
    "f3d4": 1247,
    "f3d5": 1248,
    "f3e1": 1249,
    "f3e2": 1250,
    "f3e3": 1251,
    "f3e4": 1252,
    "f3e5": 1253,
    "f3f1": 1254,
    "f3f2": 1255,
    "f3f4": 1256,
    "f3f5": 1257,
    "f3f6": 1258,
    "f3f7": 1259,
    "f3f8": 1260,
    "f3g1": 1261,
    "f3g2": 1262,
    "f3g3": 1263,
    "f3g4": 1264,
    "f3g5": 1265,
    "f3h1": 1266,
    "f3h2": 1267,
    "f3h3": 1268,
    "f3h4": 1269,
    "f3h5": 1270,
    "f4a4": 1271,
    "f4b4": 1272,
    "f4b8": 1273,
    "f4c1": 1274,
    "f4c4": 1275,
    "f4c7": 1276,
    "f4d2": 1277,
    "f4d3": 1278,
    "f4d4": 1279,
    "f4d5": 1280,
    "f4d6": 1281,
    "f4e2": 1282,
    "f4e3": 1283,
    "f4e4": 1284,
    "f4e5": 1285,
    "f4e6": 1286,
    "f4f1": 1287,
    "f4f2": 1288,
    "f4f3": 1289,
    "f4f5": 1290,
    "f4f6": 1291,
    "f4f7": 1292,
    "f4f8": 1293,
    "f4g2": 1294,
    "f4g3": 1295,
    "f4g4": 1296,
    "f4g5": 1297,
    "f4g6": 1298,
    "f4h2": 1299,
    "f4h3": 1300,
    "f4h4": 1301,
    "f4h5": 1302,
    "f4h6": 1303,
    "f5a5": 1304,
    "f5b1": 1305,
    "f5b5": 1306,
    "f5c2": 1307,
    "f5c5": 1308,
    "f5c8": 1309,
    "f5d3": 1310,
    "f5d4": 1311,
    "f5d5": 1312,
    "f5d6": 1313,
    "f5d7": 1314,
    "f5e3": 1315,
    "f5e4": 1316,
    "f5e5": 1317,
    "f5e6": 1318,
    "f5e7": 1319,
    "f5f1": 1320,
    "f5f2": 1321,
    "f5f3": 1322,
    "f5f4": 1323,
    "f5f6": 1324,
    "f5f7": 1325,
    "f5f8": 1326,
    "f5g3": 1327,
    "f5g4": 1328,
    "f5g5": 1329,
    "f5g6": 1330,
    "f5g7": 1331,
    "f5h3": 1332,
    "f5h4": 1333,
    "f5h5": 1334,
    "f5h6": 1335,
    "f5h7": 1336,
    "f6a1": 1337,
    "f6a6": 1338,
    "f6b2": 1339,
    "f6b6": 1340,
    "f6c3": 1341,
    "f6c6": 1342,
    "f6d4": 1343,
    "f6d5": 1344,
    "f6d6": 1345,
    "f6d7": 1346,
    "f6d8": 1347,
    "f6e4": 1348,
    "f6e5": 1349,
    "f6e6": 1350,
    "f6e7": 1351,
    "f6e8": 1352,
    "f6f1": 1353,
    "f6f2": 1354,
    "f6f3": 1355,
    "f6f4": 1356,
    "f6f5": 1357,
    "f6f7": 1358,
    "f6f8": 1359,
    "f6g4": 1360,
    "f6g5": 1361,
    "f6g6": 1362,
    "f6g7": 1363,
    "f6g8": 1364,
    "f6h4": 1365,
    "f6h5": 1366,
    "f6h6": 1367,
    "f6h7": 1368,
    "f6h8": 1369,
    "f7a2": 1370,
    "f7a7": 1371,
    "f7b3": 1372,
    "f7b7": 1373,
    "f7c4": 1374,
    "f7c7": 1375,
    "f7d5": 1376,
    "f7d6": 1377,
    "f7d7": 1378,
    "f7d8": 1379,
    "f7e5": 1380,
    "f7e6": 1381,
    "f7e7": 1382,
    "f7e8": 1383,
    "f7f1": 1384,
    "f7f2": 1385,
    "f7f3": 1386,
    "f7f4": 1387,
    "f7f5": 1388,
    "f7f6": 1389,
    "f7f8": 1390,
    "f7f8b": 1391,
    "f7f8n": 1392,
    "f7f8q": 1393,
    "f7f8r": 1394,
    "f7g5": 1395,
    "f7g6": 1396,
    "f7g7": 1397,
    "f7g8": 1398,
    "f7h5": 1399,
    "f7h6": 1400,
    "f7h7": 1401,
    "f7h8": 1402,
    "f8a3": 1403,
    "f8a8": 1404,
    "f8b4": 1405,
    "f8b8": 1406,
    "f8c5": 1407,
    "f8c8": 1408,
    "f8d6": 1409,
    "f8d7": 1410,
    "f8d8": 1411,
    "f8e6": 1412,
    "f8e7": 1413,
    "f8e8": 1414,
    "f8f1": 1415,
    "f8f2": 1416,
    "f8f3": 1417,
    "f8f4": 1418,
    "f8f5": 1419,
    "f8f6": 1420,
    "f8f7": 1421,
    "f8g6": 1422,
    "f8g7": 1423,
    "f8g8": 1424,
    "f8h6": 1425,
    "f8h7": 1426,
    "f8h8": 1427,
    "g1a1": 1428,
    "g1a7": 1429,
    "g1b1": 1430,
    "g1b6": 1431,
    "g1c1": 1432,
    "g1c5": 1433,
    "g1d1": 1434,
    "g1d4": 1435,
    "g1e1": 1436,
    "g1e2": 1437,
    "g1e3": 1438,
    "g1f1": 1439,
    "g1f2": 1440,
    "g1f3": 1441,
    "g1g2": 1442,
    "g1g3": 1443,
    "g1g4": 1444,
    "g1g5": 1445,
    "g1g6": 1446,
    "g1g7": 1447,
    "g1g8": 1448,
    "g1h1": 1449,
    "g1h2": 1450,
    "g1h3": 1451,
    "g2a2": 1452,
    "g2a8": 1453,
    "g2b2": 1454,
    "g2b7": 1455,
    "g2c2": 1456,
    "g2c6": 1457,
    "g2d2": 1458,
    "g2d5": 1459,
    "g2e1": 1460,
    "g2e2": 1461,
    "g2e3": 1462,
    "g2e4": 1463,
    "g2f1": 1464,
    "g2f2": 1465,
    "g2f3": 1466,
    "g2f4": 1467,
    "g2g1": 1468,
    "g2g1b": 1469,
    "g2g1n": 1470,
    "g2g1q": 1471,
    "g2g1r": 1472,
    "g2g3": 1473,
    "g2g4": 1474,
    "g2g5": 1475,
    "g2g6": 1476,
    "g2g7": 1477,
    "g2g8": 1478,
    "g2h1": 1479,
    "g2h2": 1480,
    "g2h3": 1481,
    "g2h4": 1482,
    "g3a3": 1483,
    "g3b3": 1484,
    "g3b8": 1485,
    "g3c3": 1486,
    "g3c7": 1487,
    "g3d3": 1488,
    "g3d6": 1489,
    "g3e1": 1490,
    "g3e2": 1491,
    "g3e3": 1492,
    "g3e4": 1493,
    "g3e5": 1494,
    "g3f1": 1495,
    "g3f2": 1496,
    "g3f3": 1497,
    "g3f4": 1498,
    "g3f5": 1499,
    "g3g1": 1500,
    "g3g2": 1501,
    "g3g4": 1502,
    "g3g5": 1503,
    "g3g6": 1504,
    "g3g7": 1505,
    "g3g8": 1506,
    "g3h1": 1507,
    "g3h2": 1508,
    "g3h3": 1509,
    "g3h4": 1510,
    "g3h5": 1511,
    "g4a4": 1512,
    "g4b4": 1513,
    "g4c4": 1514,
    "g4c8": 1515,
    "g4d1": 1516,
    "g4d4": 1517,
    "g4d7": 1518,
    "g4e2": 1519,
    "g4e3": 1520,
    "g4e4": 1521,
    "g4e5": 1522,
    "g4e6": 1523,
    "g4f2": 1524,
    "g4f3": 1525,
    "g4f4": 1526,
    "g4f5": 1527,
    "g4f6": 1528,
    "g4g1": 1529,
    "g4g2": 1530,
    "g4g3": 1531,
    "g4g5": 1532,
    "g4g6": 1533,
    "g4g7": 1534,
    "g4g8": 1535,
    "g4h2": 1536,
    "g4h3": 1537,
    "g4h4": 1538,
    "g4h5": 1539,
    "g4h6": 1540,
    "g5a5": 1541,
    "g5b5": 1542,
    "g5c1": 1543,
    "g5c5": 1544,
    "g5d2": 1545,
    "g5d5": 1546,
    "g5d8": 1547,
    "g5e3": 1548,
    "g5e4": 1549,
    "g5e5": 1550,
    "g5e6": 1551,
    "g5e7": 1552,
    "g5f3": 1553,
    "g5f4": 1554,
    "g5f5": 1555,
    "g5f6": 1556,
    "g5f7": 1557,
    "g5g1": 1558,
    "g5g2": 1559,
    "g5g3": 1560,
    "g5g4": 1561,
    "g5g6": 1562,
    "g5g7": 1563,
    "g5g8": 1564,
    "g5h3": 1565,
    "g5h4": 1566,
    "g5h5": 1567,
    "g5h6": 1568,
    "g5h7": 1569,
    "g6a6": 1570,
    "g6b1": 1571,
    "g6b6": 1572,
    "g6c2": 1573,
    "g6c6": 1574,
    "g6d3": 1575,
    "g6d6": 1576,
    "g6e4": 1577,
    "g6e5": 1578,
    "g6e6": 1579,
    "g6e7": 1580,
    "g6e8": 1581,
    "g6f4": 1582,
    "g6f5": 1583,
    "g6f6": 1584,
    "g6f7": 1585,
    "g6f8": 1586,
    "g6g1": 1587,
    "g6g2": 1588,
    "g6g3": 1589,
    "g6g4": 1590,
    "g6g5": 1591,
    "g6g7": 1592,
    "g6g8": 1593,
    "g6h4": 1594,
    "g6h5": 1595,
    "g6h6": 1596,
    "g6h7": 1597,
    "g6h8": 1598,
    "g7a1": 1599,
    "g7a7": 1600,
    "g7b2": 1601,
    "g7b7": 1602,
    "g7c3": 1603,
    "g7c7": 1604,
    "g7d4": 1605,
    "g7d7": 1606,
    "g7e5": 1607,
    "g7e6": 1608,
    "g7e7": 1609,
    "g7e8": 1610,
    "g7f5": 1611,
    "g7f6": 1612,
    "g7f7": 1613,
    "g7f8": 1614,
    "g7g1": 1615,
    "g7g2": 1616,
    "g7g3": 1617,
    "g7g4": 1618,
    "g7g5": 1619,
    "g7g6": 1620,
    "g7g8": 1621,
    "g7g8b": 1622,
    "g7g8n": 1623,
    "g7g8q": 1624,
    "g7g8r": 1625,
    "g7h5": 1626,
    "g7h6": 1627,
    "g7h7": 1628,
    "g7h8": 1629,
    "g8a2": 1630,
    "g8a8": 1631,
    "g8b3": 1632,
    "g8b8": 1633,
    "g8c4": 1634,
    "g8c8": 1635,
    "g8d5": 1636,
    "g8d8": 1637,
    "g8e6": 1638,
    "g8e7": 1639,
    "g8e8": 1640,
    "g8f6": 1641,
    "g8f7": 1642,
    "g8f8": 1643,
    "g8g1": 1644,
    "g8g2": 1645,
    "g8g3": 1646,
    "g8g4": 1647,
    "g8g5": 1648,
    "g8g6": 1649,
    "g8g7": 1650,
    "g8h6": 1651,
    "g8h7": 1652,
    "g8h8": 1653,
    "h1a1": 1654,
    "h1a8": 1655,
    "h1b1": 1656,
    "h1b7": 1657,
    "h1c1": 1658,
    "h1c6": 1659,
    "h1d1": 1660,
    "h1d5": 1661,
    "h1e1": 1662,
    "h1e4": 1663,
    "h1f1": 1664,
    "h1f2": 1665,
    "h1f3": 1666,
    "h1g1": 1667,
    "h1g2": 1668,
    "h1g3": 1669,
    "h1h2": 1670,
    "h1h3": 1671,
    "h1h4": 1672,
    "h1h5": 1673,
    "h1h6": 1674,
    "h1h7": 1675,
    "h1h8": 1676,
    "h2a2": 1677,
    "h2b2": 1678,
    "h2b8": 1679,
    "h2c2": 1680,
    "h2c7": 1681,
    "h2d2": 1682,
    "h2d6": 1683,
    "h2e2": 1684,
    "h2e5": 1685,
    "h2f1": 1686,
    "h2f2": 1687,
    "h2f3": 1688,
    "h2f4": 1689,
    "h2g1": 1690,
    "h2g2": 1691,
    "h2g3": 1692,
    "h2g4": 1693,
    "h2h1": 1694,
    "h2h1b": 1695,
    "h2h1n": 1696,
    "h2h1q": 1697,
    "h2h1r": 1698,
    "h2h3": 1699,
    "h2h4": 1700,
    "h2h5": 1701,
    "h2h6": 1702,
    "h2h7": 1703,
    "h2h8": 1704,
    "h3a3": 1705,
    "h3b3": 1706,
    "h3c3": 1707,
    "h3c8": 1708,
    "h3d3": 1709,
    "h3d7": 1710,
    "h3e3": 1711,
    "h3e6": 1712,
    "h3f1": 1713,
    "h3f2": 1714,
    "h3f3": 1715,
    "h3f4": 1716,
    "h3f5": 1717,
    "h3g1": 1718,
    "h3g2": 1719,
    "h3g3": 1720,
    "h3g4": 1721,
    "h3g5": 1722,
    "h3h1": 1723,
    "h3h2": 1724,
    "h3h4": 1725,
    "h3h5": 1726,
    "h3h6": 1727,
    "h3h7": 1728,
    "h3h8": 1729,
    "h4a4": 1730,
    "h4b4": 1731,
    "h4c4": 1732,
    "h4d4": 1733,
    "h4d8": 1734,
    "h4e1": 1735,
    "h4e4": 1736,
    "h4e7": 1737,
    "h4f2": 1738,
    "h4f3": 1739,
    "h4f4": 1740,
    "h4f5": 1741,
    "h4f6": 1742,
    "h4g2": 1743,
    "h4g3": 1744,
    "h4g4": 1745,
    "h4g5": 1746,
    "h4g6": 1747,
    "h4h1": 1748,
    "h4h2": 1749,
    "h4h3": 1750,
    "h4h5": 1751,
    "h4h6": 1752,
    "h4h7": 1753,
    "h4h8": 1754,
    "h5a5": 1755,
    "h5b5": 1756,
    "h5c5": 1757,
    "h5d1": 1758,
    "h5d5": 1759,
    "h5e2": 1760,
    "h5e5": 1761,
    "h5e8": 1762,
    "h5f3": 1763,
    "h5f4": 1764,
    "h5f5": 1765,
    "h5f6": 1766,
    "h5f7": 1767,
    "h5g3": 1768,
    "h5g4": 1769,
    "h5g5": 1770,
    "h5g6": 1771,
    "h5g7": 1772,
    "h5h1": 1773,
    "h5h2": 1774,
    "h5h3": 1775,
    "h5h4": 1776,
    "h5h6": 1777,
    "h5h7": 1778,
    "h5h8": 1779,
    "h6a6": 1780,
    "h6b6": 1781,
    "h6c1": 1782,
    "h6c6": 1783,
    "h6d2": 1784,
    "h6d6": 1785,
    "h6e3": 1786,
    "h6e6": 1787,
    "h6f4": 1788,
    "h6f5": 1789,
    "h6f6": 1790,
    "h6f7": 1791,
    "h6f8": 1792,
    "h6g4": 1793,
    "h6g5": 1794,
    "h6g6": 1795,
    "h6g7": 1796,
    "h6g8": 1797,
    "h6h1": 1798,
    "h6h2": 1799,
    "h6h3": 1800,
    "h6h4": 1801,
    "h6h5": 1802,
    "h6h7": 1803,
    "h6h8": 1804,
    "h7a7": 1805,
    "h7b1": 1806,
    "h7b7": 1807,
    "h7c2": 1808,
    "h7c7": 1809,
    "h7d3": 1810,
    "h7d7": 1811,
    "h7e4": 1812,
    "h7e7": 1813,
    "h7f5": 1814,
    "h7f6": 1815,
    "h7f7": 1816,
    "h7f8": 1817,
    "h7g5": 1818,
    "h7g6": 1819,
    "h7g7": 1820,
    "h7g8": 1821,
    "h7h1": 1822,
    "h7h2": 1823,
    "h7h3": 1824,
    "h7h4": 1825,
    "h7h5": 1826,
    "h7h6": 1827,
    "h7h8": 1828,
    "h7h8b": 1829,
    "h7h8n": 1830,
    "h7h8q": 1831,
    "h7h8r": 1832,
    "h8a1": 1833,
    "h8a8": 1834,
    "h8b2": 1835,
    "h8b8": 1836,
    "h8c3": 1837,
    "h8c8": 1838,
    "h8d4": 1839,
    "h8d8": 1840,
    "h8e5": 1841,
    "h8e8": 1842,
    "h8f6": 1843,
    "h8f7": 1844,
    "h8f8": 1845,
    "h8g6": 1846,
    "h8g7": 1847,
    "h8g8": 1848,
    "h8h1": 1849,
    "h8h2": 1850,
    "h8h3": 1851,
    "h8h4": 1852,
    "h8h5": 1853,
    "h8h6": 1854,
    "h8h7": 1855
}