{
    "<END>": 0,
    "<START>": 1,
    "<UNK>": 2,
    "a1a2": 3,
    "a1a3": 4,
    "a1a4": 5,
    "a1a5": 6,
    "a1a6": 7,
    "a1a7": 8,
    "a1a8": 9,
    "a1b1": 10,
    "a1b2": 11,
    "a1b3": 12,
    "a1c1": 13,
    "a1c2": 14,
    "a1c3": 15,
    "a1d1": 16,
    "a1d4": 17,
    "a1e1": 18,
    "a1e5": 19,
    "a1f1": 20,
    "a1f6": 21,
    "a1g1": 22,
    "a1g7": 23,
    "a1h1": 24,
    "a1h8": 25,
    "a2a1": 26,
    "a2a1b": 27,
    "a2a1n": 28,
    "a2a1q": 29,
    "a2a1r": 30,
    "a2a3": 31,
    "a2a4": 32,
    "a2a5": 33,
    "a2a6": 34,
    "a2a7": 35,
    "a2a8": 36,
    "a2b1": 37,
    "a2b2": 38,
    "a2b3": 39,
    "a2b4": 40,
    "a2c1": 41,
    "a2c2": 42,
    "a2c3": 43,
    "a2c4": 44,
    "a2d2": 45,
    "a2d5": 46,
    "a2e2": 47,
    "a2e6": 48,
    "a2f2": 49,
    "a2f7": 50,
    "a2g2": 51,
    "a2g8": 52,
    "a2h2": 53,
    "a3a1": 54,
    "a3a2": 55,
    "a3a4": 56,
    "a3a5": 57,
    "a3a6": 58,
    "a3a7": 59,
    "a3a8": 60,
    "a3b1": 61,
    "a3b2": 62,
    "a3b3": 63,
    "a3b4": 64,
    "a3b5": 65,
    "a3c1": 66,
    "a3c2": 67,
    "a3c3": 68,
    "a3c4": 69,
    "a3c5": 70,
    "a3d3": 71,
    "a3d6": 72,
    "a3e3": 73,
    "a3e7": 74,
    "a3f3": 75,
    "a3f8": 76,
    "a3g3": 77,
    "a3h3": 78,
    "a4a1": 79,
    "a4a2": 80,
    "a4a3": 81,
    "a4a5": 82,
    "a4a6": 83,
    "a4a7": 84,
    "a4a8": 85,
    "a4b2": 86,
    "a4b3": 87,
    "a4b4": 88,
    "a4b5": 89,
    "a4b6": 90,
    "a4c2": 91,
    "a4c3": 92,
    "a4c4": 93,
    "a4c5": 94,
    "a4c6": 95,
    "a4d1": 96,
    "a4d4": 97,
    "a4d7": 98,
    "a4e4": 99,
    "a4e8": 100,
    "a4f4": 101,
    "a4g4": 102,
    "a4h4": 103,
    "a5a1": 104,
    "a5a2": 105,
    "a5a3": 106,
    "a5a4": 107,
    "a5a6": 108,
    "a5a7": 109,
    "a5a8": 110,
    "a5b3": 111,
    "a5b4": 112,
    "a5b5": 113,
    "a5b6": 114,
    "a5b7": 115,
    "a5c3": 116,
    "a5c4": 117,
    "a5c5": 118,
    "a5c6": 119,
    "a5c7": 120,
    "a5d2": 121,
    "a5d5": 122,
    "a5d8": 123,
    "a5e1": 124,
    "a5e5": 125,
    "a5f5": 126,
    "a5g5": 127,
    "a5h5": 128,
    "a6a1": 129,
    "a6a2": 130,
    "a6a3": 131,
    "a6a4": 132,
    "a6a5": 133,
    "a6a7": 134,
    "a6a8": 135,
    "a6b4": 136,
    "a6b5": 137,
    "a6b6": 138,
    "a6b7": 139,
    "a6b8": 140,
    "a6c4": 141,
    "a6c5": 142,
    "a6c6": 143,
    "a6c7": 144,
    "a6c8": 145,
    "a6d3": 146,
    "a6d6": 147,
    "a6e2": 148,
    "a6e6": 149,
    "a6f1": 150,
    "a6f6": 151,
    "a6g6": 152,
    "a6h6": 153,
    "a7a1": 154,
    "a7a2": 155,
    "a7a3": 156,
    "a7a4": 157,
    "a7a5": 158,
    "a7a6": 159,
    "a7a8": 160,
    "a7a8b": 161,
    "a7a8n": 162,
    "a7a8q": 163,
    "a7a8r": 164,
    "a7b5": 165,
    "a7b6": 166,
    "a7b7": 167,
    "a7b8": 168,
    "a7c5": 169,
    "a7c6": 170,
    "a7c7": 171,
    "a7c8": 172,
    "a7d4": 173,
    "a7d7": 174,
    "a7e3": 175,
    "a7e7": 176,
    "a7f2": 177,
    "a7f7": 178,
    "a7g1": 179,
    "a7g7": 180,
    "a7h7": 181,
    "a8a1": 182,
    "a8a2": 183,
    "a8a3": 184,
    "a8a4": 185,
    "a8a5": 186,
    "a8a6": 187,
    "a8a7": 188,
    "a8b6": 189,
    "a8b7": 190,
    "a8b8": 191,
    "a8c6": 192,
    "a8c7": 193,
    "a8c8": 194,
    "a8d5": 195,
    "a8d8": 196,
    "a8e4": 197,
    "a8e8": 198,
    "a8f3": 199,
    "a8f8": 200,
    "a8g2": 201,
    "a8g8": 202,
    "a8h1": 203,
    "a8h8": 204,
    "b1a1": 205,
    "b1a2": 206,
    "b1a3": 207,
    "b1b2": 208,
    "b1b3": 209,
    "b1b4": 210,
    "b1b5": 211,
    "b1b6": 212,
    "b1b7": 213,
    "b1b8": 214,
    "b1c1": 215,
    "b1c2": 216,
    "b1c3": 217,
    "b1d1": 218,
    "b1d2": 219,
    "b1d3": 220,
    "b1e1": 221,
    "b1e4": 222,
    "b1f1": 223,
    "b1f5": 224,
    "b1g1": 225,
    "b1g6": 226,
    "b1h1": 227,
    "b1h7": 228,
    "b2a1": 229,
    "b2a2": 230,
    "b2a3": 231,
    "b2a4": 232,
    "b2b1": 233,
    "b2b1b": 234,
    "b2b1n": 235,
    "b2b1q": 236,
    "b2b1r": 237,
    "b2b3": 238,
    "b2b4": 239,
    "b2b5": 240,
    "b2b6": 241,
    "b2b7": 242,
    "b2b8": 243,
    "b2c1": 244,
    "b2c2": 245,
    "b2c3": 246,
    "b2c4": 247,
    "b2d1": 248,
    "b2d2": 249,
    "b2d3": 250,
    "b2d4": 251,
    "b2e2": 252,
    "b2e5": 253,
    "b2f2": 254,
    "b2f6": 255,
    "b2g2": 256,
    "b2g7": 257,
    "b2h2": 258,
    "b2h8": 259,
    "b3a1": 260,
    "b3a2": 261,
    "b3a3": 262,
    "b3a4": 263,
    "b3a5": 264,
    "b3b1": 265,
    "b3b2": 266,
    "b3b4": 267,
    "b3b5": 268,
    "b3b6": 269,
    "b3b7": 270,
    "b3b8": 271,
    "b3c1": 272,
    "b3c2": 273,
    "b3c3": 274,
    "b3c4": 275,
    "b3c5": 276,
    "b3d1": 277,
    "b3d2": 278,
    "b3d3": 279,
    "b3d4": 280,
    "b3d5": 281,
    "b3e3": 282,
    "b3e6": 283,
    "b3f3": 284,
    "b3f7": 285,
    "b3g3": 286,
    "b3g8": 287,
    "b3h3": 288,
    "b4a2": 289,
    "b4a3": 290,
    "b4a4": 291,
    "b4a5": 292,
    "b4a6": 293,
    "b4b1": 294,
    "b4b2": 295,
    "b4b3": 296,
    "b4b5": 297,
    "b4b6": 298,
    "b4b7": 299,
    "b4b8": 300,
    "b4c2": 301,
    "b4c3": 302,
    "b4c4": 303,
    "b4c5": 304,
    "b4c6": 305,
    "b4d2": 306,
    "b4d3": 307,
    "b4d4": 308,
    "b4d5": 309,
    "b4d6": 310,
    "b4e1": 311,
    "b4e4": 312,
    "b4e7": 313,
    "b4f4": 314,
    "b4f8": 315,
    "b4g4": 316,
    "b4h4": 317,
    "b5a3": 318,
    "b5a4": 319,
    "b5a5": 320,
    "b5a6": 321,
    "b5a7": 322,
    "b5b1": 323,
    "b5b2": 324,
    "b5b3": 325,
    "b5b4": 326,
    "b5b6": 327,
    "b5b7": 328,
    "b5b8": 329,
    "b5c3": 330,
    "b5c4": 331,
    "b5c5": 332,
    "b5c6": 333,
    "b5c7": 334,
    "b5d3": 335,
    "b5d4": 336,
    "b5d5": 337,
    "b5d6": 338,
    "b5d7": 339,
    "b5e2": 340,
    "b5e5": 341,
    "b5e8": 342,
    "b5f1": 343,
    "b5f5": 344,
    "b5g5": 345,
    "b5h5": 346,
    "b6a4": 347,
    "b6a5": 348,
    "b6a6": 349,
    "b6a7": 350,
    "b6a8": 351,
    "b6b1": 352,
    "b6b2": 353,
    "b6b3": 354,
    "b6b4": 355,
    "b6b5": 356,
    "b6b7": 357,
    "b6b8": 358,
    "b6c4": 359,
    "b6c5": 360,
    "b6c6": 361,
    "b6c7": 362,
    "b6c8": 363,
    "b6d4": 364,
    "b6d5": 365,
    "b6d6": 366,
    "b6d7": 367,
    "b6d8": 368,
    "b6e3": 369,
    "b6e6": 370,
    "b6f2": 371,
    "b6f6": 372,
    "b6g1": 373,
    "b6g6": 374,
    "b6h6": 375,
    "b7a5": 376,
    "b7a6": 377,
    "b7a7": 378,
    "b7a8": 379,
    "b7b1": 380,
    "b7b2": 381,
    "b7b3": 382,
    "b7b4": 383,
    "b7b5": 384,
    "b7b6": 385,
    "b7b8": 386,
    "b7b8b": 387,
    "b7b8n": 388,
    "b7b8q": 389,
    "b7b8r": 390,
    "b7c5": 391,
    "b7c6": 392,
    "b7c7": 393,
    "b7c8": 394,
    "b7d5": 395,
    "b7d6": 396,
    "b7d7": 397,
    "b7d8": 398,
    "b7e4": 399,
    "b7e7": 400,
    "b7f3": 401,
    "b7f7": 402,
    "b7g2": 403,
    "b7g7": 404,
    "b7h1": 405,
    "b7h7": 406,
    "b8a6": 407,
    "b8a7": 408,
    "b8a8": 409,
    "b8b1": 410,
    "b8b2": 411,
    "b8b3": 412,
    "b8b4": 413,
    "b8b5": 414,
    "b8b6": 415,
    "b8b7": 416,
    "b8c6": 417,
    "b8c7": 418,
    "b8c8": 419,
    "b8d6": 420,
    "b8d7": 421,
    "b8d8": 422,
    "b8e5": 423,
    "b8e8": 424,
    "b8f4": 425,
    "b8f8": 426,
    "b8g3": 427,
    "b8g8": 428,
    "b8h2": 429,
    "b8h8": 430,
    "c1a1": 431,
    "c1a2": 432,
    "c1a3": 433,
    "c1b1": 434,
    "c1b2": 435,
    "c1b3": 436,
    "c1c2": 437,
    "c1c3": 438,
    "c1c4": 439,
    "c1c5": 440,
    "c1c6": 441,
    "c1c7": 442,
    "c1c8": 443,
    "c1d1": 444,
    "c1d2": 445,
    "c1d3": 446,
    "c1e1": 447,
    "c1e2": 448,
    "c1e3": 449,
    "c1f1": 450,
    "c1f4": 451,
    "c1g1": 452,
    "c1g5": 453,
    "c1h1": 454,
    "c1h6": 455,
    "c2a1": 456,
    "c2a2": 457,
    "c2a3": 458,
    "c2a4": 459,
    "c2b1": 460,
    "c2b2": 461,
    "c2b3": 462,
    "c2b4": 463,
    "c2c1": 464,
    "c2c1b": 465,
    "c2c1n": 466,
    "c2c1q": 467,
    "c2c1r": 468,
    "c2c3": 469,
    "c2c4": 470,
    "c2c5": 471,
    "c2c6": 472,
    "c2c7": 473,
    "c2c8": 474,
    "c2d1": 475,
    "c2d2": 476,
    "c2d3": 477,
    "c2d4": 478,
    "c2e1": 479,
    "c2e2": 480,
    "c2e3": 481,
    "c2e4": 482,
    "c2f2": 483,
    "c2f5": 484,
    "c2g2": 485,
    "c2g6": 486,
    "c2h2": 487,
    "c2h7": 488,
    "c3a1": 489,
    "c3a2": 490,
    "c3a3": 491,
    "c3a4": 492,
    "c3a5": 493,
    "c3b1": 494,
    "c3b2": 495,
    "c3b3": 496,
    "c3b4": 497,
    "c3b5": 498,
    "c3c1": 499,
    "c3c2": 500,
    "c3c4": 501,
    "c3c5": 502,
    "c3c6": 503,
    "c3c7": 504,
    "c3c8": 505,
    "c3d1": 506,
    "c3d2": 507,
    "c3d3": 508,
    "c3d4": 509,
    "c3d5": 510,
    "c3e1": 511,
    "c3e2": 512,
    "c3e3": 513,
    "c3e4": 514,
    "c3e5": 515,
    "c3f3": 516,
    "c3f6": 517,
    "c3g3": 518,
    "c3g7": 519,
    "c3h3": 520,
    "c3h8": 521,
    "c4a2": 522,
    "c4a3": 523,
    "c4a4": 524,
    "c4a5": 525,
    "c4a6": 526,
    "c4b2": 527,
    "c4b3": 528,
    "c4b4": 529,
    "c4b5": 530,
    "c4b6": 531,
    "c4c1": 532,
    "c4c2": 533,
    "c4c3": 534,
    "c4c5": 535,
    "c4c6": 536,
    "c4c7": 537,
    "c4c8": 538,
    "c4d2": 539,
    "c4d3": 540,
    "c4d4": 541,
    "c4d5": 542,
    "c4d6": 543,
    "c4e2": 544,
    "c4e3": 545,
    "c4e4": 546,
    "c4e5": 547,
    "c4e6": 548,
    "c4f1": 549,
    "c4f4": 550,
    "c4f7": 551,
    "c4g4": 552,
    "c4g8": 553,
    "c4h4": 554,
    "c5a3": 555,
    "c5a4": 556,
    "c5a5": 557,
    "c5a6": 558,
    "c5a7": 559,
    "c5b3": 560,
    "c5b4": 561,
    "c5b5": 562,
    "c5b6": 563,
    "c5b7": 564,
    "c5c1": 565,
    "c5c2": 566,
    "c5c3": 567,
    "c5c4": 568,
    "c5c6": 569,
    "c5c7": 570,
    "c5c8": 571,
    "c5d3": 572,
    "c5d4": 573,
    "c5d5": 574,
    "c5d6": 575,
    "c5d7": 576,
    "c5e3": 577,
    "c5e4": 578,
    "c5e5": 579,
    "c5e6": 580,
    "c5e7": 581,
    "c5f2": 582,
    "c5f5": 583,
    "c5f8": 584,
    "c5g1": 585,
    "c5g5": 586,
    "c5h5": 587,
    "c6a4": 588,
    "c6a5": 589,
    "c6a6": 590,
    "c6a7": 591,
    "c6a8": 592,
    "c6b4": 593,
    "c6b5": 594,
    "c6b6": 595,
    "c6b7": 596,
    "c6b8": 597,
    "c6c1": 598,
    "c6c2": 599,
    "c6c3": 600,
    "c6c4": 601,
    "c6c5": 602,
    "c6c7": 603,
    "c6c8": 604,
    "c6d4": 605,
    "c6d5": 606,
    "c6d6": 607,
    "c6d7": 608,
    "c6d8": 609,
    "c6e4": 610,
    "c6e5": 611,
    "c6e6": 612,
    "c6e7": 613,
    "c6e8": 614,
    "c6f3": 615,
    "c6f6": 616,
    "c6g2": 617,
    "c6g6": 618,
    "c6h1": 619,
    "c6h6": 620,
    "c7a5": 621,
    "c7a6": 622,
    "c7a7": 623,
    "c7a8": 624,
    "c7b5": 625,
    "c7b6": 626,
    "c7b7": 627,
    "c7b8": 628,
    "c7c1": 629,
    "c7c2": 630,
    "c7c3": 631,
    "c7c4": 632,
    "c7c5": 633,
    "c7c6": 634,
    "c7c8": 635,
    "c7c8b": 636,
    "c7c8n": 637,
    "c7c8q": 638,
    "c7c8r": 639,
    "c7d5": 640,
    "c7d6": 641,
    "c7d7": 642,
    "c7d8": 643,
    "c7e5": 644,
    "c7e6": 645,
    "c7e7": 646,
    "c7e8": 647,
    "c7f4": 648,
    "c7f7": 649,
    "c7g3": 650,
    "c7g7": 651,
    "c7h2": 652,
    "c7h7": 653,
    "c8a6": 654,
    "c8a7": 655,
    "c8a8": 656,
    "c8b6": 657,
    "c8b7": 658,
    "c8b8": 659,
    "c8c1": 660,
    "c8c2": 661,
    "c8c3": 662,
    "c8c4": 663,
    "c8c5": 664,
    "c8c6": 665,
    "c8c7": 666,
    "c8d6": 667,
    "c8d7": 668,
    "c8d8": 669,
    "c8e6": 670,
    "c8e7": 671,
    "c8e8": 672,
    "c8f5": 673,
    "c8f8": 674,
    "c8g4": 675,
    "c8g8": 676,
    "c8h3": 677,
    "c8h8": 678,
    "d1a1": 679,
    "d1a4": 680,
    "d1b1": 681,
    "d1b2": 682,
    "d1b3": 683,
    "d1c1": 684,
    "d1c2": 685,
    "d1c3": 686,
    "d1d2": 687,
    "d1d3": 688,
    "d1d4": 689,
    "d1d5": 690,
    "d1d6": 691,
    "d1d7": 692,
    "d1d8": 693,
    "d1e1": 694,
    "d1e2": 695,
    "d1e3": 696,
    "d1f1": 697,
    "d1f2": 698,
    "d1f3": 699,
    "d1g1": 700,
    "d1g4": 701,
    "d1h1": 702,
    "d1h5": 703,
    "d2a2": 704,
    "d2a5": 705,
    "d2b1": 706,
    "d2b2": 707,
    "d2b3": 708,
    "d2b4": 709,
    "d2c1": 710,
    "d2c2": 711,
    "d2c3": 712,
    "d2c4": 713,
    "d2d1": 714,
    "d2d1b": 715,
    "d2d1n": 716,
    "d2d1q": 717,
    "d2d1r": 718,
    "d2d3": 719,
    "d2d4": 720,
    "d2d5": 721,
    "d2d6": 722,
    "d2d7": 723,
    "d2d8": 724,
    "d2e1": 725,
    "d2e2": 726,
    "d2e3": 727,
    "d2e4": 728,
    "d2f1": 729,
    "d2f2": 730,
    "d2f3": 731,
    "d2f4": 732,
    "d2g2": 733,
    "d2g5": 734,
    "d2h2": 735,
    "d2h6": 736,
    "d3a3": 737,
    "d3a6": 738,
    "d3b1": 739,
    "d3b2": 740,
    "d3b3": 741,
    "d3b4": 742,
    "d3b5": 743,
    "d3c1": 744,
    "d3c2": 745,
    "d3c3": 746,
    "d3c4": 747,
    "d3c5": 748,
    "d3d1": 749,
    "d3d2": 750,
    "d3d4": 751,
    "d3d5": 752,
    "d3d6": 753,
    "d3d7": 754,
    "d3d8": 755,
    "d3e1": 756,
    "d3e2": 757,
    "d3e3": 758,
    "d3e4": 759,
    "d3e5": 760,
    "d3f1": 761,
    "d3f2": 762,
    "d3f3": 763,
    "d3f4": 764,
    "d3f5": 765,
    "d3g3": 766,
    "d3g6": 767,
    "d3h3": 768,
    "d3h7": 769,
    "d4a1": 770,
    "d4a4": 771,
    "d4a7": 772,
    "d4b2": 773,
    "d4b3": 774,
    "d4b4": 775,
    "d4b5": 776,
    "d4b6": 777,
    "d4c2": 778,
    "d4c3": 779,
    "d4c4": 780,
    "d4c5": 781,
    "d4c6": 782,
    "d4d1": 783,
    "d4d2": 784,
    "d4d3": 785,
    "d4d5": 786,
    "d4d6": 787,
    "d4d7": 788,
    "d4d8": 789,
    "d4e2": 790,
    "d4e3": 791,
    "d4e4": 792,
    "d4e5": 793,
    "d4e6": 794,
    "d4f2": 795,
    "d4f3": 796,
    "d4f4": 797,
    "d4f5": 798,
    "d4f6": 799,
    "d4g1": 800,
    "d4g4": 801,
    "d4g7": 802,
    "d4h4": 803,
    "d4h8": 804,
    "d5a2": 805,
    "d5a5": 806,
    "d5a8": 807,
    "d5b3": 808,
    "d5b4": 809,
    "d5b5": 810,
    "d5b6": 811,
    "d5b7": 812,
    "d5c3": 813,
    "d5c4": 814,
    "d5c5": 815,
    "d5c6": 816,
    "d5c7": 817,
    "d5d1": 818,
    "d5d2": 819,
    "d5d3": 820,
    "d5d4": 821,
    "d5d6": 822,
    "d5d7": 823,
    "d5d8": 824,
    "d5e3": 825,
    "d5e4": 826,
    "d5e5": 827,
    "d5e6": 828,
    "d5e7": 829,
    "d5f3": 830,
    "d5f4": 831,
    "d5f5": 832,
    "d5f6": 833,
    "d5f7": 834,
    "d5g2": 835,
    "d5g5": 836,
    "d5g8": 837,
    "d5h1": 838,
    "d5h5": 839,
    "d6a3": 840,
    "d6a6": 841,
    "d6b4": 842,
    "d6b5": 843,
    "d6b6": 844,
    "d6b7": 845,
    "d6b8": 846,
    "d6c4": 847,
    "d6c5": 848,
    "d6c6": 849,
    "d6c7": 850,
    "d6c8": 851,
    "d6d1": 852,
    "d6d2": 853,
    "d6d3": 854,
    "d6d4": 855,
    "d6d5": 856,
    "d6d7": 857,
    "d6d8": 858,
    "d6e4": 859,
    "d6e5": 860,
    "d6e6": 861,
    "d6e7": 862,
    "d6e8": 863,
    "d6f4": 864,
    "d6f5": 865,
    "d6f6": 866,
    "d6f7": 867,
    "d6f8": 868,
    "d6g3": 869,
    "d6g6": 870,
    "d6h2": 871,
    "d6h6": 872,
    "d7a4": 873,
    "d7a7": 874,
    "d7b5": 875,
    "d7b6": 876,
    "d7b7": 877,
    "d7b8": 878,
    "d7c5": 879,
    "d7c6": 880,
    "d7c7": 881,
    "d7c8": 882,
    "d7d1": 883,
    "d7d2": 884,
    "d7d3": 885,
    "d7d4": 886,
    "d7d5": 887,
    "d7d6": 888,
    "d7d8": 889,
    "d7d8b": 890,
    "d7d8n": 891,
    "d7d8q": 892,
    "d7d8r": 893,
    "d7e5": 894,
    "d7e6": 895,
    "d7e7": 896,
    "d7e8": 897,
    "d7f5": 898,
    "d7f6": 899,
    "d7f7": 900,
    "d7f8": 901,
    "d7g4": 902,
    "d7g7": 903,
    "d7h3": 904,
    "d7h7": 905,
    "d8a5": 906,
    "d8a8": 907,
    "d8b6": 908,
    "d8b7": 909,
    "d8b8": 910,
    "d8c6": 911,
    "d8c7": 912,
    "d8c8": 913,
    "d8d1": 914,
    "d8d2": 915,
    "d8d3": 916,
    "d8d4": 917,
    "d8d5": 918,
    "d8d6": 919,
    "d8d7": 920,
    "d8e6": 921,
    "d8e7": 922,
    "d8e8": 923,
    "d8f6": 924,
    "d8f7": 925,
    "d8f8": 926,
    "d8g5": 927,
    "d8g8": 928,
    "d8h4": 929,
    "d8h8": 930,
    "e1a1": 931,
    "e1a5": 932,
    "e1b1": 933,
    "e1b4": 934,
    "e1c1": 935,
    "e1c2": 936,
    "e1c3": 937,
    "e1d1": 938,
    "e1d2": 939,
    "e1d3": 940,
    "e1e2": 941,
    "e1e3": 942,
    "e1e4": 943,
    "e1e5": 944,
    "e1e6": 945,
    "e1e7": 946,
    "e1e8": 947,
    "e1f1": 948,
    "e1f2": 949,
    "e1f3": 950,
    "e1g1": 951,
    "e1g2": 952,
    "e1g3": 953,
    "e1h1": 954,
    "e1h4": 955,
    "e2a2": 956,
    "e2a6": 957,
    "e2b2": 958,
    "e2b5": 959,
    "e2c1": 960,
    "e2c2": 961,
    "e2c3": 962,
    "e2c4": 963,
    "e2d1": 964,
    "e2d2": 965,
    "e2d3": 966,
    "e2d4": 967,
    "e2e1": 968,
    "e2e1b": 969,
    "e2e1n": 970,
    "e2e1q": 971,
    "e2e1r": 972,
    "e2e3": 973,
    "e2e4": 974,
    "e2e5": 975,
    "e2e6": 976,
    "e2e7": 977,
    "e2e8": 978,
    "e2f1": 979,
    "e2f2": 980,
    "e2f3": 981,
    "e2f4": 982,
    "e2g1": 983,
    "e2g2": 984,
    "e2g3": 985,
    "e2g4": 986,
    "e2h2": 987,
    "e2h5": 988,
    "e3a3": 989,
    "e3a7": 990,
    "e3b3": 991,
    "e3b6": 992,
    "e3c1": 993,
    "e3c2": 994,
    "e3c3": 995,
    "e3c4": 996,
    "e3c5": 997,
    "e3d1": 998,
    "e3d2": 999,
    "e3d3": 1000,
    "e3d4": 1001,
    "e3d5": 1002,
    "e3e1": 1003,
    "e3e2": 1004,
    "e3e4": 1005,
    "e3e5": 1006,
    "e3e6": 1007,
    "e3e7": 1008,
    "e3e8": 1009,
    "e3f1": 1010,
    "e3f2": 1011,
    "e3f3": 1012,
    "e3f4": 1013,
    "e3f5": 1014,
    "e3g1": 1015,
    "e3g2": 1016,
    "e3g3": 1017,
    "e3g4": 1018,
    "e3g5": 1019,
    "e3h3": 1020,
    "e3h6": 1021,
    "e4a4": 1022,
    "e4a8": 1023,
    "e4b1": 1024,
    "e4b4": 1025,
    "e4b7": 1026,
    "e4c2": 1027,
    "e4c3": 1028,
    "e4c4": 1029,
    "e4c5": 1030,
    "e4c6": 1031,
    "e4d2": 1032,
    "e4d3": 1033,
    "e4d4": 1034,
    "e4d5": 1035,
    "e4d6": 1036,
    "e4e1": 1037,
    "e4e2": 1038,
    "e4e3": 1039,
    "e4e5": 1040,
    "e4e6": 1041,
    "e4e7": 1042,
    "e4e8": 1043,
    "e4f2": 1044,
    "e4f3": 1045,
    "e4f4": 1046,
    "e4f5": 1047,
    "e4f6": 1048,
    "e4g2": 1049,
    "e4g3": 1050,
    "e4g4": 1051,
    "e4g5": 1052,
    "e4g6": 1053,
    "e4h1": 1054,
    "e4h4": 1055,
    "e4h7": 1056,
    "e5a1": 1057,
    "e5a5": 1058,
    "e5b2": 1059,
    "e5b5": 1060,
    "e5b8": 1061,
    "e5c3": 1062,
    "e5c4": 1063,
    "e5c5": 1064,
    "e5c6": 1065,
    "e5c7": 1066,
    "e5d3": 1067,
    "e5d4": 1068,
    "e5d5": 1069,
    "e5d6": 1070,
    "e5d7": 1071,
    "e5e1": 1072,
    "e5e2": 1073,
    "e5e3": 1074,
    "e5e4": 1075,
    "e5e6": 1076,
    "e5e7": 1077,
    "e5e8": 1078,
    "e5f3": 1079,
    "e5f4": 1080,
    "e5f5": 1081,
    "e5f6": 1082,
    "e5f7": 1083,
    "e5g3": 1084,
    "e5g4": 1085,
    "e5g5": 1086,
    "e5g6": 1087,
    "e5g7": 1088,
    "e5h2": 1089,
    "e5h5": 1090,
    "e5h8": 1091,
    "e6a2": 1092,
    "e6a6": 1093,
    "e6b3": 1094,
    "e6b6": 1095,
    "e6c4": 1096,
    "e6c5": 1097,
    "e6c6": 1098,
    "e6c7": 1099,
    "e6c8": 1100,
    "e6d4": 1101,
    "e6d5": 1102,
    "e6d6": 1103,
    "e6d7": 1104,
    "e6d8": 1105,
    "e6e1": 1106,
    "e6e2": 1107,
    "e6e3": 1108,
    "e6e4": 1109,
    "e6e5": 1110,
    "e6e7": 1111,
    "e6e8": 1112,
    "e6f4": 1113,
    "e6f5": 1114,
    "e6f6": 1115,
    "e6f7": 1116,
    "e6f8": 1117,
    "e6g4": 1118,
    "e6g5": 1119,
    "e6g6": 1120,
    "e6g7": 1121,
    "e6g8": 1122,
    "e6h3": 1123,
    "e6h6": 1124,
    "e7a3": 1125,
    "e7a7": 1126,
    "e7b4": 1127,
    "e7b7": 1128,
    "e7c5": 1129,
    "e7c6": 1130,
    "e7c7": 1131,
    "e7c8": 1132,
    "e7d5": 1133,
    "e7d6": 1134,
    "e7d7": 1135,
    "e7d8": 1136,
    "e7e1": 1137,
    "e7e2": 1138,
    "e7e3": 1139,
    "e7e4": 1140,
    "e7e5": 1141,
    "e7e6": 1142,
    "e7e8": 1143,
    "e7e8b": 1144,
    "e7e8n": 1145,
    "e7e8q": 1146,
    "e7e8r": 1147,
    "e7f5": 1148,
    "e7f6": 1149,
    "e7f7": 1150,
    "e7f8": 1151,
    "e7g5": 1152,
    "e7g6": 1153,
    "e7g7": 1154,
    "e7g8": 1155,
    "e7h4": 1156,
    "e7h7": 1157,
    "e8a4": 1158,
    "e8a8": 1159,
    "e8b5": 1160,
    "e8b8": 1161,
    "e8c6": 1162,
    "e8c7": 1163,
    "e8c8": 1164,
    "e8d6": 1165,
    "e8d7": 1166,
    "e8d8": 1167,
    "e8e1": 1168,
    "e8e2": 1169,
    "e8e3": 1170,
    "e8e4": 1171,
    "e8e5": 1172,
    "e8e6": 1173,
    "e8e7": 1174,
    "e8f6": 1175,
    "e8f7": 1176,
    "e8f8": 1177,
    "e8g6": 1178,
    "e8g7": 1179,
    "e8g8": 1180,
    "e8h5": 1181,
    "e8h8": 1182,
    "f1a1": 1183,
    "f1a6": 1184,
    "f1b1": 1185,
    "f1b5": 1186,
    "f1c1": 1187,
    "f1c4": 1188,
    "f1d1": 1189,
    "f1d2": 1190,
    "f1d3": 1191,
    "f1e1": 1192,
    "f1e2": 1193,
    "f1e3": 1194,
    "f1f2": 1195,
    "f1f3": 1196,
    "f1f4": 1197,
    "f1f5": 1198,
    "f1f6": 1199,
    "f1f7": 1200,
    "f1f8": 1201,
    "f1g1": 1202,
    "f1g2": 1203,
    "f1g3": 1204,
    "f1h1": 1205,
    "f1h2": 1206,
    "f1h3": 1207,
    "f2a2": 1208,
    "f2a7": 1209,
    "f2b2": 1210,
    "f2b6": 1211,
    "f2c2": 1212,
    "f2c5": 1213,
    "f2d1": 1214,
    "f2d2": 1215,
    "f2d3": 1216,
    "f2d4": 1217,
    "f2e1": 1218,
    "f2e2": 1219,
    "f2e3": 1220,
    "f2e4": 1221,
    "f2f1": 1222,
    "f2f1b": 1223,
    "f2f1n": 1224,
    "f2f1q": 1225,
    "f2f1r": 1226,
    "f2f3": 1227,
    "f2f4": 1228,
    "f2f5": 1229,
    "f2f6": 1230,
    "f2f7": 1231,
    "f2f8": 1232,
    "f2g1": 1233,
    "f2g2": 1234,
    "f2g3": 1235,
    "f2g4": 1236,
    "f2h1": 1237,
    "f2h2": 1238,
    "f2h3": 1239,
    "f2h4": 1240,
    "f3a3": 1241,
    "f3a8": 1242,
    "f3b3": 1243,
    "f3b7": 1244,
    "f3c3": 1245,
    "f3c6": 1246,
    "f3d1": 1247,
    "f3d2": 1248,
    "f3d3": 1249,
    "f3d4": 1250,
    "f3d5": 1251,
    "f3e1": 1252,
    "f3e2": 1253,
    "f3e3": 1254,
    "f3e4": 1255,
    "f3e5": 1256,
    "f3f1": 1257,
    "f3f2": 1258,
    "f3f4": 1259,
    "f3f5": 1260,
    "f3f6": 1261,
    "f3f7": 1262,
    "f3f8": 1263,
    "f3g1": 1264,
    "f3g2": 1265,
    "f3g3": 1266,
    "f3g4": 1267,
    "f3g5": 1268,
    "f3h1": 1269,
    "f3h2": 1270,
    "f3h3": 1271,
    "f3h4": 1272,
    "f3h5": 1273,
    "f4a4": 1274,
    "f4b4": 1275,
    "f4b8": 1276,
    "f4c1": 1277,
    "f4c4": 1278,
    "f4c7": 1279,
    "f4d2": 1280,
    "f4d3": 1281,
    "f4d4": 1282,
    "f4d5": 1283,
    "f4d6": 1284,
    "f4e2": 1285,
    "f4e3": 1286,
    "f4e4": 1287,
    "f4e5": 1288,
    "f4e6": 1289,
    "f4f1": 1290,
    "f4f2": 1291,
    "f4f3": 1292,
    "f4f5": 1293,
    "f4f6": 1294,
    "f4f7": 1295,
    "f4f8": 1296,
    "f4g2": 1297,
    "f4g3": 1298,
    "f4g4": 1299,
    "f4g5": 1300,
    "f4g6": 1301,
    "f4h2": 1302,
    "f4h3": 1303,
    "f4h4": 1304,
    "f4h5": 1305,
    "f4h6": 1306,
    "f5a5": 1307,
    "f5b1": 1308,
    "f5b5": 1309,
    "f5c2": 1310,
    "f5c5": 1311,
    "f5c8": 1312,
    "f5d3": 1313,
    "f5d4": 1314,
    "f5d5": 1315,
    "f5d6": 1316,
    "f5d7": 1317,
    "f5e3": 1318,
    "f5e4": 1319,
    "f5e5": 1320,
    "f5e6": 1321,
    "f5e7": 1322,
    "f5f1": 1323,
    "f5f2": 1324,
    "f5f3": 1325,
    "f5f4": 1326,
    "f5f6": 1327,
    "f5f7": 1328,
    "f5f8": 1329,
    "f5g3": 1330,
    "f5g4": 1331,
    "f5g5": 1332,
    "f5g6": 1333,
    "f5g7": 1334,
    "f5h3": 1335,
    "f5h4": 1336,
    "f5h5": 1337,
    "f5h6": 1338,
    "f5h7": 1339,
    "f6a1": 1340,
    "f6a6": 1341,
    "f6b2": 1342,
    "f6b6": 1343,
    "f6c3": 1344,
    "f6c6": 1345,
    "f6d4": 1346,
    "f6d5": 1347,
    "f6d6": 1348,
    "f6d7": 1349,
    "f6d8": 1350,
    "f6e4": 1351,
    "f6e5": 1352,
    "f6e6": 1353,
    "f6e7": 1354,
    "f6e8": 1355,
    "f6f1": 1356,
    "f6f2": 1357,
    "f6f3": 1358,
    "f6f4": 1359,
    "f6f5": 1360,
    "f6f7": 1361,
    "f6f8": 1362,
    "f6g4": 1363,
    "f6g5": 1364,
    "f6g6": 1365,
    "f6g7": 1366,
    "f6g8": 1367,
    "f6h4": 1368,
    "f6h5": 1369,
    "f6h6": 1370,
    "f6h7": 1371,
    "f6h8": 1372,
    "f7a2": 1373,
    "f7a7": 1374,
    "f7b3": 1375,
    "f7b7": 1376,
    "f7c4": 1377,
    "f7c7": 1378,
    "f7d5": 1379,
    "f7d6": 1380,
    "f7d7": 1381,
    "f7d8": 1382,
    "f7e5": 1383,
    "f7e6": 1384,
    "f7e7": 1385,
    "f7e8": 1386,
    "f7f1": 1387,
    "f7f2": 1388,
    "f7f3": 1389,
    "f7f4": 1390,
    "f7f5": 1391,
    "f7f6": 1392,
    "f7f8": 1393,
    "f7f8b": 1394,
    "f7f8n": 1395,
    "f7f8q": 1396,
    "f7f8r": 1397,
    "f7g5": 1398,
    "f7g6": 1399,
    "f7g7": 1400,
    "f7g8": 1401,
    "f7h5": 1402,
    "f7h6": 1403,
    "f7h7": 1404,
    "f7h8": 1405,
    "f8a3": 1406,
    "f8a8": 1407,
    "f8b4": 1408,
    "f8b8": 1409,
    "f8c5": 1410,
    "f8c8": 1411,
    "f8d6": 1412,
    "f8d7": 1413,
    "f8d8": 1414,
    "f8e6": 1415,
    "f8e7": 1416,
    "f8e8": 1417,
    "f8f1": 1418,
    "f8f2": 1419,
    "f8f3": 1420,
    "f8f4": 1421,
    "f8f5": 1422,
    "f8f6": 1423,
    "f8f7": 1424,
    "f8g6": 1425,
    "f8g7": 1426,
    "f8g8": 1427,
    "f8h6": 1428,
    "f8h7": 1429,
    "f8h8": 1430,
    "g1a1": 1431,
    "g1a7": 1432,
    "g1b1": 1433,
    "g1b6": 1434,
    "g1c1": 1435,
    "g1c5": 1436,
    "g1d1": 1437,
    "g1d4": 1438,
    "g1e1": 1439,
    "g1e2": 1440,
    "g1e3": 1441,
    "g1f1": 1442,
    "g1f2": 1443,
    "g1f3": 1444,
    "g1g2": 1445,
    "g1g3": 1446,
    "g1g4": 1447,
    "g1g5": 1448,
    "g1g6": 1449,
    "g1g7": 1450,
    "g1g8": 1451,
    "g1h1": 1452,
    "g1h2": 1453,
    "g1h3": 1454,
    "g2a2": 1455,
    "g2a8": 1456,
    "g2b2": 1457,
    "g2b7": 1458,
    "g2c2": 1459,
    "g2c6": 1460,
    "g2d2": 1461,
    "g2d5": 1462,
    "g2e1": 1463,
    "g2e2": 1464,
    "g2e3": 1465,
    "g2e4": 1466,
    "g2f1": 1467,
    "g2f2": 1468,
    "g2f3": 1469,
    "g2f4": 1470,
    "g2g1": 1471,
    "g2g1b": 1472,
    "g2g1n": 1473,
    "g2g1q": 1474,
    "g2g1r": 1475,
    "g2g3": 1476,
    "g2g4": 1477,
    "g2g5": 1478,
    "g2g6": 1479,
    "g2g7": 1480,
    "g2g8": 1481,
    "g2h1": 1482,
    "g2h2": 1483,
    "g2h3": 1484,
    "g2h4": 1485,
    "g3a3": 1486,
    "g3b3": 1487,
    "g3b8": 1488,
    "g3c3": 1489,
    "g3c7": 1490,
    "g3d3": 1491,
    "g3d6": 1492,
    "g3e1": 1493,
    "g3e2": 1494,
    "g3e3": 1495,
    "g3e4": 1496,
    "g3e5": 1497,
    "g3f1": 1498,
    "g3f2": 1499,
    "g3f3": 1500,
    "g3f4": 1501,
    "g3f5": 1502,
    "g3g1": 1503,
    "g3g2": 1504,
    "g3g4": 1505,
    "g3g5": 1506,
    "g3g6": 1507,
    "g3g7": 1508,
    "g3g8": 1509,
    "g3h1": 1510,
    "g3h2": 1511,
    "g3h3": 1512,
    "g3h4": 1513,
    "g3h5": 1514,
    "g4a4": 1515,
    "g4b4": 1516,
    "g4c4": 1517,
    "g4c8": 1518,
    "g4d1": 1519,
    "g4d4": 1520,
    "g4d7": 1521,
    "g4e2": 1522,
    "g4e3": 1523,
    "g4e4": 1524,
    "g4e5": 1525,
    "g4e6": 1526,
    "g4f2": 1527,
    "g4f3": 1528,
    "g4f4": 1529,
    "g4f5": 1530,
    "g4f6": 1531,
    "g4g1": 1532,
    "g4g2": 1533,
    "g4g3": 1534,
    "g4g5": 1535,
    "g4g6": 1536,
    "g4g7": 1537,
    "g4g8": 1538,
    "g4h2": 1539,
    "g4h3": 1540,
    "g4h4": 1541,
    "g4h5": 1542,
    "g4h6": 1543,
    "g5a5": 1544,
    "g5b5": 1545,
    "g5c1": 1546,
    "g5c5": 1547,
    "g5d2": 1548,
    "g5d5": 1549,
    "g5d8": 1550,
    "g5e3": 1551,
    "g5e4": 1552,
    "g5e5": 1553,
    "g5e6": 1554,
    "g5e7": 1555,
    "g5f3": 1556,
    "g5f4": 1557,
    "g5f5": 1558,
    "g5f6": 1559,
    "g5f7": 1560,
    "g5g1": 1561,
    "g5g2": 1562,
    "g5g3": 1563,
    "g5g4": 1564,
    "g5g6": 1565,
    "g5g7": 1566,
    "g5g8": 1567,
    "g5h3": 1568,
    "g5h4": 1569,
    "g5h5": 1570,
    "g5h6": 1571,
    "g5h7": 1572,
    "g6a6": 1573,
    "g6b1": 1574,
    "g6b6": 1575,
    "g6c2": 1576,
    "g6c6": 1577,
    "g6d3": 1578,
    "g6d6": 1579,
    "g6e4": 1580,
    "g6e5": 1581,
    "g6e6": 1582,
    "g6e7": 1583,
    "g6e8": 1584,
    "g6f4": 1585,
    "g6f5": 1586,
    "g6f6": 1587,
    "g6f7": 1588,
    "g6f8": 1589,
    "g6g1": 1590,
    "g6g2": 1591,
    "g6g3": 1592,
    "g6g4": 1593,
    "g6g5": 1594,
    "g6g7": 1595,
    "g6g8": 1596,
    "g6h4": 1597,
    "g6h5": 1598,
    "g6h6": 1599,
    "g6h7": 1600,
    "g6h8": 1601,
    "g7a1": 1602,
    "g7a7": 1603,
    "g7b2": 1604,
    "g7b7": 1605,
    "g7c3": 1606,
    "g7c7": 1607,
    "g7d4": 1608,
    "g7d7": 1609,
    "g7e5": 1610,
    "g7e6": 1611,
    "g7e7": 1612,
    "g7e8": 1613,
    "g7f5": 1614,
    "g7f6": 1615,
    "g7f7": 1616,
    "g7f8": 1617,
    "g7g1": 1618,
    "g7g2": 1619,
    "g7g3": 1620,
    "g7g4": 1621,
    "g7g5": 1622,
    "g7g6": 1623,
    "g7g8": 1624,
    "g7g8b": 1625,
    "g7g8n": 1626,
    "g7g8q": 1627,
    "g7g8r": 1628,
    "g7h5": 1629,
    "g7h6": 1630,
    "g7h7": 1631,
    "g7h8": 1632,
    "g8a2": 1633,
    "g8a8": 1634,
    "g8b3": 1635,
    "g8b8": 1636,
    "g8c4": 1637,
    "g8c8": 1638,
    "g8d5": 1639,
    "g8d8": 1640,
    "g8e6": 1641,
    "g8e7": 1642,
    "g8e8": 1643,
    "g8f6": 1644,
    "g8f7": 1645,
    "g8f8": 1646,
    "g8g1": 1647,
    "g8g2": 1648,
    "g8g3": 1649,
    "g8g4": 1650,
    "g8g5": 1651,
    "g8g6": 1652,
    "g8g7": 1653,
    "g8h6": 1654,
    "g8h7": 1655,
    "g8h8": 1656,
    "h1a1": 1657,
    "h1a8": 1658,
    "h1b1": 1659,
    "h1b7": 1660,
    "h1c1": 1661,
    "h1c6": 1662,
    "h1d1": 1663,
    "h1d5": 1664,
    "h1e1": 1665,
    "h1e4": 1666,
    "h1f1": 1667,
    "h1f2": 1668,
    "h1f3": 1669,
    "h1g1": 1670,
    "h1g2": 1671,
    "h1g3": 1672,
    "h1h2": 1673,
    "h1h3": 1674,
    "h1h4": 1675,
    "h1h5": 1676,
    "h1h6": 1677,
    "h1h7": 1678,
    "h1h8": 1679,
    "h2a2": 1680,
    "h2b2": 1681,
    "h2b8": 1682,
    "h2c2": 1683,
    "h2c7": 1684,
    "h2d2": 1685,
    "h2d6": 1686,
    "h2e2": 1687,
    "h2e5": 1688,
    "h2f1": 1689,
    "h2f2": 1690,
    "h2f3": 1691,
    "h2f4": 1692,
    "h2g1": 1693,
    "h2g2": 1694,
    "h2g3": 1695,
    "h2g4": 1696,
    "h2h1": 1697,
    "h2h1b": 1698,
    "h2h1n": 1699,
    "h2h1q": 1700,
    "h2h1r": 1701,
    "h2h3": 1702,
    "h2h4": 1703,
    "h2h5": 1704,
    "h2h6": 1705,
    "h2h7": 1706,
    "h2h8": 1707,
    "h3a3": 1708,
    "h3b3": 1709,
    "h3c3": 1710,
    "h3c8": 1711,
    "h3d3": 1712,
    "h3d7": 1713,
    "h3e3": 1714,
    "h3e6": 1715,
    "h3f1": 1716,
    "h3f2": 1717,
    "h3f3": 1718,
    "h3f4": 1719,
    "h3f5": 1720,
    "h3g1": 1721,
    "h3g2": 1722,
    "h3g3": 1723,
    "h3g4": 1724,
    "h3g5": 1725,
    "h3h1": 1726,
    "h3h2": 1727,
    "h3h4": 1728,
    "h3h5": 1729,
    "h3h6": 1730,
    "h3h7": 1731,
    "h3h8": 1732,
    "h4a4": 1733,
    "h4b4": 1734,
    "h4c4": 1735,
    "h4d4": 1736,
    "h4d8": 1737,
    "h4e1": 1738,
    "h4e4": 1739,
    "h4e7": 1740,
    "h4f2": 1741,
    "h4f3": 1742,
    "h4f4": 1743,
    "h4f5": 1744,
    "h4f6": 1745,
    "h4g2": 1746,
    "h4g3": 1747,
    "h4g4": 1748,
    "h4g5": 1749,
    "h4g6": 1750,
    "h4h1": 1751,
    "h4h2": 1752,
    "h4h3": 1753,
    "h4h5": 1754,
    "h4h6": 1755,
    "h4h7": 1756,
    "h4h8": 1757,
    "h5a5": 1758,
    "h5b5": 1759,
    "h5c5": 1760,
    "h5d1": 1761,
    "h5d5": 1762,
    "h5e2": 1763,
    "h5e5": 1764,
    "h5e8": 1765,
    "h5f3": 1766,
    "h5f4": 1767,
    "h5f5": 1768,
    "h5f6": 1769,
    "h5f7": 1770,
    "h5g3": 1771,
    "h5g4": 1772,
    "h5g5": 1773,
    "h5g6": 1774,
    "h5g7": 1775,
    "h5h1": 1776,
    "h5h2": 1777,
    "h5h3": 1778,
    "h5h4": 1779,
    "h5h6": 1780,
    "h5h7": 1781,
    "h5h8": 1782,
    "h6a6": 1783,
    "h6b6": 1784,
    "h6c1": 1785,
    "h6c6": 1786,
    "h6d2": 1787,
    "h6d6": 1788,
    "h6e3": 1789,
    "h6e6": 1790,
    "h6f4": 1791,
    "h6f5": 1792,
    "h6f6": 1793,
    "h6f7": 1794,
    "h6f8": 1795,
    "h6g4": 1796,
    "h6g5": 1797,
    "h6g6": 1798,
    "h6g7": 1799,
    "h6g8": 1800,
    "h6h1": 1801,
    "h6h2": 1802,
    "h6h3": 1803,
    "h6h4": 1804,
    "h6h5": 1805,
    "h6h7": 1806,
    "h6h8": 1807,
    "h7a7": 1808,
    "h7b1": 1809,
    "h7b7": 1810,
    "h7c2": 1811,
    "h7c7": 1812,
    "h7d3": 1813,
    "h7d7": 1814,
    "h7e4": 1815,
    "h7e7": 1816,
    "h7f5": 1817,
    "h7f6": 1818,
    "h7f7": 1819,
    "h7f8": 1820,
    "h7g5": 1821,
    "h7g6": 1822,
    "h7g7": 1823,
    "h7g8": 1824,
    "h7h1": 1825,
    "h7h2": 1826,
    "h7h3": 1827,
    "h7h4": 1828,
    "h7h5": 1829,
    "h7h6": 1830,
    "h7h8": 1831,
    "h7h8b": 1832,
    "h7h8n": 1833,
    "h7h8q": 1834,
    "h7h8r": 1835,
    "h8a1": 1836,
    "h8a8": 1837,
    "h8b2": 1838,
    "h8b8": 1839,
    "h8c3": 1840,
    "h8c8": 1841,
    "h8d4": 1842,
    "h8d8": 1843,
    "h8e5": 1844,
    "h8e8": 1845,
    "h8f6": 1846,
    "h8f7": 1847,
    "h8f8": 1848,
    "h8g6": 1849,
    "h8g7": 1850,
    "h8g8": 1851,
    "h8h1": 1852,
    "h8h2": 1853,
    "h8h3": 1854,
    "h8h4": 1855,
    "h8h5": 1856,
    "h8h6": 1857,
    "h8h7": 1858
}